[
  {
    "title": "Head First Statistics for Data Analysis",
    "description": "What will you learn from this book?Do you need to analyze data but feel lost in a sea of numbers? Your guide is here—without the dry, academic jargon. This hands-on, visually rich book introduces key statistical concepts and shows you how to apply them using Excel. Whether you're a data analyst, a business professional, or just someone who wants to make better decisions with data, you'll gain the practical skills needed to extract meaningful insights. From probability and confidence intervals to regression and forecasting, this book makes statistics approachable, relevant, and—even better—understandable.What's so special about this book?If you've read a Head First book before, you know what to expect: a uniquely engaging, brain-friendly approach that helps you truly learn instead of struggling through dense theory. Through clear explanations, hands-on exercises, and interactive visuals, you'll develop the skills to confidently analyze data and make informed decisions. No more guesswork—just real statistical insights at your fingertips.",
    "published_at": "July 2027",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341607736/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341607736/160h/?format=webp"
  },
  {
    "title": "CompTIA Network+ Study Guide",
    "description": "Network technicians and administrators are in high demand, and that demand is only growing. The CompTIA Network+ is widely recognized as the essential certification for all network technicians as well as a vendor-neutral stepping stone to vendor-specific network implementation credentials. It also confirms that holders have the foundational knowledge required for network security roles such as cybersecurity analyst, engineer, and pentester. That's a lot of words to say that every tech and aspiring network administrator should get CompTIA Network+ certified. And this book is all you need to prepare.Scott Jernigan, a trainer with decades of experience preparing people for certification exams, covers Network+ exam objectives in depth but also includes practice tests, recommendations for industry tools, and a corresponding video course. You'll explore everything from foundational concepts to the nitty-gritty of securing, monitoring, and troubleshooting your networks.The CompTIA Network+ starts IT careers—this guide will show you the way.Explore network architecture and topologiesSet up network connectivity in a local office, to the internet, and to the cloudMonitor network speed and loadDeliver a secure network and keep up with attacks and trends",
    "published_at": "December 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098178413/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098178413/160h/?format=webp"
  },
  {
    "title": "AI Engineering Interviews",
    "description": "Generative AI is rapidly spreading across industries, and companies are actively hiring people who can design, build, and deploy these systems. But to land one of these roles, you'll have to get through the interview first. Generative AI Interviews walks you through every stage of the interview process, giving you an insider's perspective that will help you build confidence and stand out.This handy guide features 300 real-world interview questions organized by difficulty level, each with a clear outline of what makes a good answer, common pitfalls to avoid, and key points you shouldn't miss. What sets this book apart from others is Mina Ghashami and Ali Torkamani's knack for simplifying complex concepts into intuitive explanations, accompanied by compelling illustrations that make learning engaging. If you're looking for a guide to cracking GenAI interviews, this is it.Master GenAI interviews for roles from fundamental to advancedExplore 300 real industry interview questions with model answers and breakdownsLearn a step-by-step approach to explaining architecture, training, inference, and evaluationGet actionable insights that will help you stand out in even the most competitive hiring process",
    "published_at": "December 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623521/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623521/160h/?format=webp"
  },
  {
    "title": "Follow the Money",
    "description": "Why do great engineers and team leads stumble when scaling up? Why do thriving businesses fumble large-scale technical transformations? At its core, a business is a way of managing how money enters, circulates, and leaves an organization. Yet most software engineers stick to code and architecture, overlooking the financial and organizational structures that underpin their work.This book looks at technical delivery using the lens of \"money flows.\" Building on Conway's law, which states that organizations' products tend to reflect their own communication structures, Follow the Money argues that those communication structures are themselves molded by money flows. Understanding how money actually moves in your organization will give you the knowledge to revamp ineffective financial structures to fix the organizational problems that are holding you back.Use systems thinking to tease out the significant feedback loops in your organizationExplain the core key financial concepts every technical leader needs to succeedIdentify (and correct) funding patterns that stifle innovation or encourage technical debtApply an easy-to-use framework to analyze your organization from customer (or \"patron,\") down to lines of codeLearn the mysterious arts of aligning financial strategy with your technical delivery",
    "published_at": "December 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341661349/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341661349/160h/?format=webp"
  },
  {
    "title": "Designing Financial Data Architectures",
    "description": "The financial industry runs on a vast and complex data ecosystem—one that presents unique challenges and requirements for financial market players. To make sense of this complexity, financial institutions must design data architectures that do more than just move data—they must support real business needs, account for the unique nature of financial data, and meet the industry's high standards for compliance, performance, and resilience.Designing Financial Data Architectures provides a comprehensive guide to building data frameworks tailored to the requirements of modern financial systems. Whether supporting trading and payments, powering an investment platform, enabling AI-powered analytics, or meeting ever-evolving compliance demands, this book equips professionals with the principles and design patterns to structure, manage, and optimize financial data systems.Understand the financial data landscape and its data management challenges Learn about financial data modelling, semantics, ontologies, and entity relationship diagrams Implement governance frameworks for data security, quality, and compliance Design data architectures tailored to the needs of financial markets Master the principles of operational and analytical data architecture for financial systems Leverage AI-driven methodologies to enhance data-driven decision-making",
    "published_at": "December 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341627185/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341627185/160h/?format=webp"
  },
  {
    "title": "AI Agents: The Definitive Guide",
    "description": "As AI agents move from research labs into production, engineering teams face mounting challenges—fragile tools, rising inference costs, erratic behavior, and unmet expectations. AI Agents: The Definitive Guide addresses what most books avoid: how to design, deploy, and maintain autonomous LLM agents that actually work in the real world. Written by Nicole Koenigstein, a leader in agentic AI with deep experience across finance, research, and engineering, this book offers the practical, system-level foundations needed to build robust, scalable, and secure agentic systems.Whether you're tasked with making agent prototypes production-ready or building mission-critical automation from the ground up, this book guides you through every layer of the stack. It covers architectures, tool integration, performance optimization, safety strategies, and advanced evaluation, with a relentless focus on reliability and long-term value.Design agent systems using modern frameworks like Reflexion, ReAct, and LangGraphOptimize deployment with advanced model techniques and GPU-aware inference strategies Securely integrate agents with tools using sandboxing, API contracts, and interface isolationBuild rigorous agent evaluation pipelines and address \"agent-washing\" failuresScale fault-tolerant agents across orchestration platforms like Ray and KubernetesApply debugging and monitoring practices to ensure safe agent reasoning and execution",
    "published_at": "November 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/0642572247775/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:0642572247775/160h/?format=webp"
  },
  {
    "title": "Building Data Products",
    "description": "As organizations grapple with fragmented data, siloed teams, and inconsistent pipelines, data products have emerged as a practical solution for delivering trusted, scalable, and reusable data assets. In Building Data Products, Jean-Georges Perrin provides a comprehensive, standards-driven playbook for designing, implementing, and scaling data products that fuel innovation and cross-functional collaboration—whether or not your organization adopts a full data mesh strategy.Drawing on extensive industry experience and practitioner interviews, Perrin shows readers how to build metadata-rich, governed data products aligned to business domains. Covering foundational concepts, real-world use cases, and emerging standards like Bitol ODPS and ODCS, this guide offers step-by-step implementation advice and practical code examples for key stages—ownership, observability, active metadata, compliance, and integration.Design data products for modular reuse, discoverability, and trustImplement standards-driven architectures with rich metadata and securityIncorporate AI-driven automation, SBOMs, and data contractsScale product-driven data strategies across teams and platformsIntegrate data products into APIs, CI/CD pipelines, and DevOps practices",
    "published_at": "November 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341629394/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341629394/160h/?format=webp"
  },
  {
    "title": "Agentic Graph RAG",
    "description": "What if your AI systems could retrieve information, reason over complex knowledge, plan actions, and continuously learn—all while maintaining enterprise-grade security and compliance? Agentic Graph RAG guides technical leaders, engineers, and architects through the next evolution of generative AI. Combining retrieval-augmented generation (RAG) with graph-based reasoning and agentic capabilities, this guide provides a practical blueprint for building scalable, auditable, and intelligent AI systems.Written by Anthony Alcaraz, this book demystifies knowledge graphs, graph memory, neural-symbolic reasoning, and agent orchestration through real-world case studies, hands-on design patterns, and production-ready architectures. Readers will learn how to construct graph-native retrieval systems, integrate advanced reasoning into agent workflows, and address enterprise challenges around governance, scalability, and transparency.Design graph-augmented architectures that surpass traditional RAG Implement agents with dynamic memory, planning, and decision-making capabilities Integrate knowledge graphs with large language models for robust, explainable AI Deploy scalable, governable multiagent systems ready for production environments",
    "published_at": "November 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623163/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623163/160h/?format=webp"
  },
  {
    "title": "Learning Cybersecurity Fundamentals",
    "description": "Cybersecurity is now a business-critical function at the core of every organization. Learning Cybersecurity Fundamentals introduces readers to this vital field through the lens of the NIST 2.0 Cybersecurity Framework. Written by Nicole Dove, CIA, CRMA, this guide demystifies cybersecurity team structures and explains the core principles that harden, govern, and protect the systems we rely on. Whether you're a student, an early-career professional, or considering a career change, this book helps you align your skills with in-demand roles.With clear explanations, relatable examples, and chapter-end quizzes, this book goes beyond theory to prepare aspiring professionals for real-world impact. You'll build foundational skills in threat detection, data protection, access management, and more—all while developing a strong understanding of cybersecurity's strategic importance and what that means for your career potential.Understand the six core pillars of cybersecurityLearn how cybersecurity teams are structured and what they doApply the NIST 2.0 Framework in practical settingsPerform key tasks like vulnerability remediation and incident responseExplore career paths and essential industry skills",
    "published_at": "October 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623590/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623590/160h/?format=webp"
  },
  {
    "title": "Head First Algorithms and Data Structures",
    "description": "What will you learn from this book?Successful software engineers all have this in common: They're fluent in the language of algorithms and data structures. Head First Algorithms and Data Structures is your gateway to becoming a part of this dynamic world. Guided by the expert insights of Eric Freeman and Elisabeth Robson, you'll unravel the complexities of algorithms and data structures through games, puzzles, and other entertaining challenges that will have you coding efficiently, scaling effectively, and acing your technical interviews in no time.What's so special about this book?If you've read a Head First book, you know what to expect: a visually rich format designed for the way your brain works. If you haven't, you're in for a treat. Whether you're taking your first steps in programming or seeking to hone your skills, you'll solidify your algorithmic thinking through a multisensory experience that engages your mind—not a text-heavy approach that puts you to sleep.",
    "published_at": "October 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098174071/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098174071/160h/?format=webp"
  },
  {
    "title": "Certified Information Systems Security Professional (CISSP) Study Guide",
    "description": "CISSP certification is the gold standard of cybersecurity certifications, and it's often a prerequisite for advancement in an information security career. If you're thinking of taking the CISSP exam, or if you just want to get up-to-date on current industry standards, this engaging and comprehensive guide will give you all the necessary resources.With his work for ISC2, author Kevin Henry may have taught more CISSP candidates than anyone in the world. His crystal-clear explanations render complex security concepts easily digestible, and his emphasis on real-world examples makes each topic relevant and concrete. You'll dive deep into the eight domains of the CISSP as well as the most current threats, technologies, and best practices in today's industry. You'll also learn proven strategies for successful prep, and tips to boost your confidence in the exam or on the job.Effectively prepare for and successfully complete the CISSP examReview the fundamental principles and best practices that form the foundation of information securityUnderstand the strategic role of information security in supporting business objectivesAnalyze complex security scenarios and make risk-based decisions by integrating knowledge from multiple domainsIdentify and remediate security vulnerabilities using a systematic approach that considers the entire security lifecycleImplement security controls and countermeasures that align with industry frameworks",
    "published_at": "October 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341652934/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341652934/160h/?format=webp"
  },
  {
    "title": "Building Resilient Distributed Systems",
    "description": "Struggling with system failures despite multiple safeguards? In the world of software development, distributed systems have proven essential yet remain complex. If you're tired of facing unexpected downtimes and persistent system vulnerabilities, you're not alone.In this insightful guide, author Sam Newman offers more than just technical solutions. By combining wisdom from human factors and system safety with proven stability patterns, you'll uncover a clear pathway to truly enhance resilience. Whether you're refining an existing system, embarking on creating new microservices, or simply striving to grasp the essence of resilience, this book is your ally. By the end, you'll be able to: Grasp the true essence of resilience by integrating safety and human factorsDiscover architectural patterns that ensure system stabilityTranslate resilience theories into practical, actionable strategiesEmbrace the necessary cultural and behavioral shifts to support a resilient system",
    "published_at": "September 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098163532/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098163532/160h/?format=webp"
  },
  {
    "title": "GraphRAG: The Definitive Guide",
    "description": "As powerful as large language models (LLMs) have become, they often fail to deliver accurate, explainable results due to their limited access to reliable data. GraphRAG is the next evolution of the foundational retrieval-augmented generation (RAG) architecture, combining the structured intelligence of knowledge graphs with the power of LLMs to deliver deeper, more trustworthy outputs. This book gives you the tools, skills, and confidence to make sense of this complex approach.Go beyond simple vector search to discover how graph-powered retrieval offers context-rich, explainable answers at scale. Written by industry leaders in knowledge graphs and generative AI, this concise and practical guide gives developers, AI engineers, and data scientists a complete introduction to GraphRAG, from core concepts to production-ready applications. Through real-world examples and proven best practices, you'll gain the skills to integrate GraphRAG into your AI stack and build smarter, more reliable systems.Learn how to model, build, and apply knowledge graphs to structured and unstructured dataImplement GraphRAG techniques to improve the accuracy and explainability of GenAI applicationsApply a broad set of retrieval patterns for agentic systems and advanced AI workflowsUnderstand business use cases and research innovations driving this technology forward Turn GraphRAG concepts into scalable GenAI applications",
    "published_at": "September 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341630147/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341630147/160h/?format=webp"
  },
  {
    "title": "Analytics Engineering with Microsoft Fabric and Power BI",
    "description": "While Microsoft Power BI has dominated the business intelligence market for years and is a go-to tool for creating visually appealing, interactive reports and dashboards, it's now an integral part of Microsoft Fabric, the end-to-end analytics platform that offers unprecedented flexibility and scalability for building enterprise-grade data analytics solutions.This book covers everything analytics engineers need to know to design and implement robust and efficient analytics solutions using Microsoft Fabric and Power BI. You'll learn the core components of Fabric, such as lakehouses, warehouses, and eventhouses, and how to work with semantic models, ensuring that data is structured and ready for analysis. You'll also discover essential techniques in both Microsoft Fabric and Power BI that you can apply in your day-to-day work.Explore the core components of Microsoft FabricImplement, manage, and optimize Power BI semantic modelsDiscover numerous architectural solutions with Microsoft Fabric and Power BIBuild Fabric items such as lakehouses, warehouses, semantic models, and more, and share them within your organizationIdentify when to use a particular Fabric item or implement a particular design patternImplement the analytics development lifecycleOptimize and fine-tune existing analytics solutions",
    "published_at": "September 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341645868/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341645868/160h/?format=webp"
  },
  {
    "title": "Fluent Web Development",
    "description": "Navigating the web development landscape can be bewildering. The terrain is crowded with frameworks, each claiming to be the one true solution. And framework vendors often introduce new acronyms for existing techniques and paradigms, which adds to the confusion. In this hype-driven environment, senior engineers must make technology choices that will impact projects for years, with little room for failure.Fluent Web Development takes engineers on a deep dive beyond the hype to the core of web application development. With this book, you'll grasp the consequences of architectural and technical decisions and examine web apps from every angle, enabling the creation of long-lasting solutions, faster bug detection, and the ability to deliver focused, high-impact code reviews. With this knowledge, you'll zero in on what truly matters for your projects.Understand what web development frameworks and libraries doLearn how tooling and dependencies can make or break a projectExplore the intricacies of every part of the stack and how everything plays togetherPlan web projects long-term and design for maintainable, flexible, and robust solutionsConfigure every part of the stack, from backend to frontend",
    "published_at": "September 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341608672/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341608672/160h/?format=webp"
  },
  {
    "title": "Delightful Intelligence",
    "description": "Artificial intelligence promises to revolutionize how businesses interact with customers, and companies are scrambling to incorporate AI into their products. Yet many will fail, unable to bridge the critical gap between AI capabilities and user satisfaction. Delightful Intelligence gives business leaders a map to building AI-powered experiences that exceed customer expectations. Product leaders Ramli John, C. Todd Lombardo, and Michael Connors help you tackle the critical challenges of implementing human-centered design in AI products, cutting through the hype to provide actionable insights and practical advice on creating AI products that don't just work—they delight.Through five guiding principles and real-world case studies from leading AI companies, you'll learn how to:Avoid common pitfalls in AI implementation that lead to user frustrationBalance automation with personalization to create meaningful interactionsDesign AI products that foster trust, transparency, and seamless usabilityTurn first-time users into loyal customers and loyal customers into enthusiastic advocatesWhether you're a product manager aiming to deliver value through AI, a UX researcher seeking to align AI solutions with user needs, or a designer striving to create intuitive experiences, Delightful Intelligence equips you with the tools and strategies to succeed.",
    "published_at": "September 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098180829/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098180829/160h/?format=webp"
  },
  {
    "title": "Head First SQL, 2nd Edition",
    "description": "What will you learn from this book? Do you have an abundance of data but don't know how to make sense of it? Do you want to gain useful insights from your data, but you're not sure where to begin? Mining data is a vital, well-paying skill, and SQL provides the most fundamental way to query and manage data. But learning SQL can be intimidating. This thoroughly revised book teaches you SQL fundamentals in a painless and enjoyable manner. With the Head First series' hands-on, conversational style, you'll quickly grasp SQL concepts, then move to intermediate topics, including stored procedures and cloud databases. You'll gain the knowledge, skills, and confidence necessary to get the most out of your data with SQL. Why does this book look so different? If you've read a Head First book, you know what to expect: a visually rich format designed for the way your brain works. If you haven't, you're in for a treat. With this book, you'll learn about SQL through a multisensory experience that engages your mind—rather than a text-heavy approach that puts you to sleep.",
    "published_at": "August 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098163648/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098163648/160h/?format=webp"
  },
  {
    "title": "Google Professional Cloud Architect Study Guide",
    "description": "The Google Professional Cloud Architect certification demonstrates a competency in designing, developing, and deploying a secure, scalable, and robust Google Cloud architecture built to satisfy your organization's needs. The certification looks good on your resume, but more importantly, it gives you the confidence you need to be a working Google Cloud architect. In this book by Google trainer Patrick Haggerty, you'll learn how core Google Cloud services work and how best to apply them. With a good study plan, plenty of practice, and a strategy for approaching the certification exam, you'll be prepared for success on the day of the test. But more importantly, you'll have all the knowledge you need to become a good, solid cloud architect. With this guide, you'll learn how to: Design a best practices cloud architecture to meet and exceed organizational needs Provision and manage core infrastructure designed for security and compliance Optimize technical and business processes Manage the cloud resources your organization depends on Ensure operational reliability and high availability Select services to solve organizational problems while optimizing for functionality, cost, performance, security, fault tolerance, and high availability Patrick Haggerty has worked as a professional trainer and consultant for more than 30 years. He spends most of his days working for ROI Training and Google, helping people learn to leverage Google Cloud.",
    "published_at": "August 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098154752/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098154752/160h/?format=webp"
  },
  {
    "title": "Advanced SQL",
    "description": "SQL is no longer just a querying language for relational databases—it's a foundational tool for building scalable, modern data solutions across real-time analytics, machine learning workflows, and even generative AI applications. Advanced SQL shows data professionals how to move beyond conventional SELECT statements and tap into the full power of SQL as a programming interface for today's most advanced data platforms.Written by seasoned data experts Rui Pedro Machado, Hélder Russa, and Pedro Esmeriz, this practical guide explores the role of SQL in streaming architectures (like Apache Kafka and Flink), data lake ecosystems, cloud data warehouses, and ML pipelines. Geared toward data engineers, analysts, scientists, and analytics engineers, the book combines hands-on guidance with architectural best practices to help you extend your SQL skills into emerging workloads and real-world production systems.Use SQL to design and deploy modern, end-to-end data architectures Integrate SQL with data lakes, stream processing, and cloud platforms Apply SQL in feature engineering and ML model deployment Master pipe syntax and other advanced features for scalable, efficient queries Leverage SQL to build GenAI-ready data applications and pipelines",
    "published_at": "August 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341627475/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341627475/160h/?format=webp"
  },
  {
    "title": "The C4 Model",
    "description": "Good architecture is more than just good code—it's clear communication. The C4 Model: Visualizing Software Architecture is a practical guide to creating diagrams that help teams understand, build, and talk about software systems more effectively. Developed by Simon Brown and used by thousands of teams worldwide, the C4 model breaks architecture down into four simple levels (context, container, component, and code), making it easier to see the big picture and the details.Whether you're onboarding a new teammate, presenting to stakeholders, or just trying to make sense of a complex system, this book shows you how to create visuals that actually make an impact. With approachable guidance, real examples, and tips for tailoring diagrams to different audiences, it's a must-have for any developer or architect who wants to make their ideas easier to understand.Learn how to apply the C4 model from high-level views to low-level detailsCreate diagrams that support collaboration and clarity across teamsUnderstand who each diagram is from and when to use itGo beyond C4 with other useful visual tools like dynamic views and deployment mapsKeep your diagrams in sync with real systems and evolving architecturesBuild better conversations around how your software works and why",
    "published_at": "July 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341660113/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341660113/160h/?format=webp"
  },
  {
    "title": "Vision Language Models",
    "description": "Vision language models (VLMs) combine computer vision and natural language processing to create powerful systems that can interpret, generate, and respond in multimodal contexts. Vision Language Models is a hands-on guide to building real-world VLMs using the most up-to-date stack of machine learning tools from Hugging Face, Meta (PyTorch), NVIDIA (Cuda), OpenAI (CLIP), and others, written by leading researchers and practitioners Merve Noyan, Miquel Farré, Andrés Marafioti, and Orr Zohar. From image captioning and document understanding to advanced zero-shot inference and retrieval-augmented generation (RAG), this book covers the full VLM application and development lifecycle.Designed for ML engineers, data scientists, and developers, this guide distills cutting-edge VLM research into practical techniques. Readers will learn how to prepare datasets, select the right architectures, fine-tune and deploy models, and apply them to real-world tasks across a range of industries. Explore core model architectures and alignment techniquesTrain and fine-tune VLMs with Hugging Face, PyTorch, and othersDeploy models for applications like image search and captioningImplement advanced inference strategies, from zero-shot to agentic systemsBuild scalable VLM systems ready for production use",
    "published_at": "July 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341624030/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341624030/160h/?format=webp"
  },
  {
    "title": "Terraform at Scale",
    "description": "Terraform is the most popular infrastructure-as-code technology available today. It makes configuring thousands of cloud resources a snap, but things can quickly get complicated, and your infrastructure as code isn't the place you want to \"learn on the job.\" This straightforward guidebook will help you escape sticky situations—or, better yet, avoid them in the first place.Cloud infrastructure pro Robert Glenn shares successful patterns you can use to simplify the challenge of managing Terraform at any scale, along with common antipatterns and how to mitigate them. Ideal for cloud architects, infrastructure specialists, and SREs who've already mastered the phrase \"You don't have access to that repo,\" this book shows how to structure, organize, and architect your Terraform and OpenTofu projects with real-world constraints like organizational responsibilities or policy requirements.Understand how different Terraform projects interact (and interfere) with each otherUse Terraform functions, expressions, and other built-in featuresDevelop, protect, and distribute modules for effective internal useOrganize Terraform projects in the presence of organizational structures and policy constraintsIdentify tightly coupled Terraform projects and bloated Terraform statesMake size changes to Terraform projects safely and confidentlyLearn what not to do with Terraform",
    "published_at": "July 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341649705/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341649705/160h/?format=webp"
  },
  {
    "title": "Designing Cloud Native Delivery Systems",
    "description": "Are you grappling with the complexities of software delivery in today's distributed environments? As technologies evolve, so do the challenges associated with deploying and managing systems that are robust, scalable, and efficient. Yet, without a structured understanding of the architectural patterns that underpin these systems, making informed decisions can be overwhelming. In this go-to guide, Bryan Oliver and Nic Cheneweth offer a groundbreaking exploration of the architectural patterns essential for building state-of-the-art delivery systems. This book not only documents these patterns but also delves into the trade-offs and values they offer, enabling you to make optimal choices for your organization's software delivery architecture. Equip yourself with the knowledge to navigate the intricacies of highly-distributed software delivery and transform your developmental lifecycle. By reading, you'll: Understand the patterns behind modern delivery systems and the strategies they enableAnalyze the potential of delivery patterns within systems, assessing capabilities and limitationsGain a profound grasp of the architectural components that constitute effective delivery systemsChoose suitable delivery systems and patterns, optimizing both function and efficiencyIdentify effective patterns and antipatterns, so you can implement robust delivery systems",
    "published_at": "July 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098167103/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098167103/160h/?format=webp"
  },
  {
    "title": "Salesforce AI",
    "description": "AI is transforming how businesses connect with customers, streamline operations, and drive growth—all within the Salesforce ecosystem. Salesforce AI: Building, Customizing, and Embedding AI Solutions is a comprehensive guide to leveraging Salesforce's AI capabilities, from out-of-the-box tools to fully customized solutions. Designed for Salesforce developers, architects, administrators, and consultants, this book provides a step-by-step approach to implementing AI that enhances decision-making, automates processes, and personalizes customer experiences.Covering essential tools like Model Builder, Prompt Builder, and Agentforce, this guide takes readers through unlocking siloed data, integrating generative AI, and customizing Salesforce AI features for various business needs. Whether you're building predictive models, deploying AI-driven chat experiences, or embedding automation into Salesforce workflows, this book equips you with the skills to create AI-powered solutions that scale.Understand Salesforce AI architecture and its integration with Data Cloud Learn how AI enhances sales, service, and marketing strategies Utilize Salesforce's AI builder tools to implement and customize solutions Deploy Agentforce for intelligent automation Customize AI models to optimize CRM efficiency and customer engagement",
    "published_at": "July 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623095/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623095/160h/?format=webp"
  },
  {
    "title": "MLOps with Databricks",
    "description": "MLOps engineers have to deal with a glut of tools and SaaS applications, not to mention technical debt clogging the system. Such complexity requires a comprehensive approach. The Databricks Platform provides all the critical components for end-to-end MLOps and LLMOps in one place. This exhaustive book shows you how to use Databricks to build and manage a robust ML system that delivers on your business's needs.Maria Vechtomova guides you through MLOps principles and explains how Databricks handles the machine learning lifecycle holistically, from data preparation to model deployment and monitoring, and enables data engineers, data scientists, and MLOps engineers to collaborate seamlessly. To put all the pieces together, you'll navigate two ML projects: a real-time ML application and a RAG system that highlights LLM-specific Databricks features.Understand the Databricks components for MLOpsUnpack ML model serving architecturesTrack your machine learning experiments and register your modelsBuild an ML application that uses feature and model serving, and model serving with automatic feature lookupDeploy a real-time ML application and a RAG applicationUse Databricks to monitor ML applications for data and model drift",
    "published_at": "June 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341608245/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341608245/160h/?format=webp"
  },
  {
    "title": "CompTIA Linux+ Study Guide",
    "description": "While most operating systems come and go, Linux has steadily become the backbone of modern computing. The CompTIA Linux+ certification is the industry's most respected vendor-neutral credential, and the XK0-005 exam is your gateway to earning it. This study guide is a comprehensive learning solution, covering all exam objectives from system configuration and security to automation and troubleshooting.What sets this book apart is its integration of modern Linux practices with certification requirements. So, while mastering the fundamentals, you'll also explore the technologies shaping today's Linux landscape: Docker, systemd, cloud integration, and infrastructure automation tools. With hands-on labs based on real-world enterprise scenarios, this book serves as both a certification prep resource and a practical guide for working professionals.Tackle the CompTIA Linux+ XK0-005 certification exam with confidencePerform essential system management tasksImplement security best practicesCreate and execute shell scripts to automate common administrative tasksDeploy and manage containerized applications using Docker or PodmanConfigure network interfaces, routing, and name resolutionTroubleshoot and resolve complex system, network, and application issuesMonitor system performance and identify resource bottlenecksDeploy infrastructure automation using common tools like Ansible",
    "published_at": "June 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341647107/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341647107/160h/?format=webp"
  },
  {
    "title": "Hands-On RAG for Production",
    "description": "Retrieval-augmented generation (RAG) is the go-to strategy for integrating large language models with your organization's unique knowledge. However, the market is full of RAG pipelines and components, making it hard to choose the right solution for your enterprise's needs. This book simplifies the process, offering a comprehensive road map to building, refining, and scaling production-grade RAG applications.Authors Ofer Mendelevitch and Forrest Bao guide you through every phase of development, from data ingestion, embeddings, and vector search to advanced techniques like agentic RAG, multimodal RAG, and GraphRAG. Engineers and architects will learn how to tackle the challenges they'll encounter when building RAG applications at enterprise scale: ensuring high accuracy with minimal hallucinations, maintaining low-latency performance, safeguarding data privacy, and providing transparent, explainable responses among them.Determine whether to build RAG yourself or deploy a RAG-as-a-service platformBuild a basic RAG stack that maximizes performance and cost-effectivenessMeasure key metrics such as hallucinations, response quality, latency, and costAddress challenges in enterprise deployment, such as compliance with data security and privacy requirements, explainability, and prompt designImplement advanced techniques such as multimodal RAG, agentic RAG, and GraphRAG",
    "published_at": "June 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341621701/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341621701/160h/?format=webp"
  },
  {
    "title": "Data Architecture",
    "description": "In today's interconnected software landscape, understanding data architecture is essential for building efficient, modern systems. Software architects, engineers, and data professionals alike need tools to design and evolve architectures to effectively handle and act on vast amounts of data. This book offers you a comprehensive exploration of operational and analytical data architectures, the trade-offs involved, and when it's time to migrate to a new style.Packed with practical advice, authors Pramod Sadalage and Premanand Chandrasekaran help readers make informed decisions about moving, storing, and processing data at scale to meet business needs, end user demands, and maintainer requirements. Learn how to partition data, manage reporting and caching in operational systems, and structure your architecture to ensure accessibility and efficiency. Whether you're designing from scratch or modernizing an existing system, this is the resource you need to make thoughtful, future-proof choices.Understand why data architecture is critical for modern software systemsExplore operational and analytical data architecture styles and their usesIdentify the key trade-offs in choosing or updating your architectureMigrate data architectures effectively to support new demandsImplement strategies for data partitioning, reporting, and caching",
    "published_at": "June 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098181185/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098181185/160h/?format=webp"
  },
  {
    "title": "A Day in the Life of a Senior Leader",
    "description": "Everyone knows that senior leaders have extraordinary demands on their time. Their stamina, decisiveness, and high-wire balancing of resources, people, and priorities can seem superhuman. In this book, Michael Lopp, a senior leader at companies such as Slack, Pinterest, and Apple, brings the day-to-day reality of senior leadership back down to earth. In his engaging style, Lopp chronicles the practices and pitfalls that often define a typical senior leader's day, from the morning ritual to eleventh-hour emergencies and finding meaning and purpose outside of work.Through short essays and longer chapters, you'll get a front-row seat to the at-times unpredictable, insufferable, and productive meetings, conversations, people, and processes that fill the hours—and practical insights on how to improve the skills you need to thrive in your role. Whether you're an acting senior leader or just aspiring to be, the essays in this book will spark recognition and reflection and help you to be more intentional about how you spend your most precious resource: your time.Build the skills needed to succeed as a senior leaderLearn how to navigate challenging scenariosManage your time and mental resources more efficiently and flexiblyPrioritize between competing demands, both at work and at home, without burning outRemember to have fun",
    "published_at": "June 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098162924/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098162924/160h/?format=webp"
  },
  {
    "title": "Programming Rust, 3rd Edition",
    "description": "Rust combines low-level control with memory safety, making it an ideal choice for systems programming. This practical guide is for experienced programmers looking to write fast, reliable code while avoiding common pitfalls like data races and buffer overflows. Authors Jim Blandy, Jason Orendorff, and Leonora Tindall explain Rust's unique approach to ownership, borrowing, and concurrency, helping you build safe, high-performance applications. Fully updated for Rust's 2024 edition, this book introduces the latest language advancements while covering essential topics like generics, async programming, and C interoperability. Whether you're working on low-latency systems, embedded software, or multithreaded applications, this edition equips you with the knowledge to write efficient, production-ready Rust code. Learn Rust's core principles, including ownership, borrowing, and lifetimes Write safe, efficient concurrent code without data races Use powerful features like macros, closures, and async programming Integrate Rust with C and C++ through FFI and unsafe code Apply best practices to write performance-critical, memory-safe applications",
    "published_at": "June 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098176228/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098176228/160h/?format=webp"
  },
  {
    "title": "High Performance Spark, 2nd Edition",
    "description": "Apache Spark is amazing when everything clicks. But if you haven't seen the performance improvements you expected or still don't feel confident enough to use Spark in production, this practical book is for you. Authors Holden Karau, Rachel Warren, and Anya Bida walk you through the secrets of the Spark code base, and demonstrate performance optimizations that will help your data pipelines run faster, scale to larger datasets, and avoid costly antipatterns. Ideal for data engineers, software engineers, data scientists, and system administrators, the second edition of High Performance Spark presents new use cases, code examples, and best practices for Spark 3.x and beyond. This book gives you a fresh perspective on this continually evolving framework and shows you how to work around bumps on your Spark and PySpark journey. With this book, you'll learn how to: Accelerate your ML workflows with integrations including PyTorch Handle key skew and take advantage of Spark's new dynamic partitioning Make your code reliable with scalable testing and validation techniques Make Spark high performance Deploy Spark on Kubernetes and similar environments Take advantage of GPU acceleration with RAPIDS and resource profiles Get your Spark jobs to run faster Use Spark to productionize exploratory data science projects Handle even larger datasets with Spark Gain faster insights by reducing pipeline running times",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098145842/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098145842/160h/?format=webp"
  },
  {
    "title": "AI Agents with MCP",
    "description": "Since its release in late 2024, Anthropic's Model Context Protocol (MCP) has redefined how developers build and connect AI agents to tools, data, and each other. AI Agents with MCP is the first comprehensive guide to this rapidly emerging standard, helping engineers unlock its full potential with hands-on projects. Whether you're developing agentic workflows, bridging tools across platforms, or creating robust multiagent systems, this book walks you through every layer of MCP—from protocol structure to server and client implementation. Author Kyle Stratis provides the practical expertise needed to build fully functional MCP servers, clients, and custom transport layers in Python. Unlike high-level overviews or fragmented documentation, this book gives you a deep systems-level understanding of MCP's capabilities—and limitations. With its flexible, model-agnostic design, MCP continues to gain traction across the generative AI community; this book ensures you're ready to build with it confidently and effectively. Understand the structure and core concepts of the Model Context Protocol Build complete MCP servers, clients, and transport layers in Python Consume tools, prompts, and data via MCP-based agent workflows Extend agent capabilities with MCP for large-scale and AI-native systems",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341639546/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341639546/160h/?format=webp"
  },
  {
    "title": "Learning Generative AI Tools for Excel",
    "description": "Looking to take your Excel skills to the next level? With the power of AI, you can supercharge your workflows, automate repetitive tasks, and perform advanced data analysis. Written for Excel users with little to no AI experience, this book bridges the gap between traditional spreadsheet skills and the revolutionary capabilities of generative AI—empowering professionals to work smarter, faster, and with greater precision. Whether you're a data analyst, financial professional, project manager, or Excel enthusiast, this book will give you practical tutorials and actionable insights for integrating AI into your everyday work. Learn how to prepare, analyze, and visualize data using tools like ChatGPT and Copilot, and leverage AI's power to generate insights that drive better business decisions. With its step-by-step guidance, this book will be your go-to reference as you unlock a new level of productivity and analytical expertise. Learn to integrate ChatGPT and Copilot with Excel for enhanced efficiency Understand AI-driven techniques for data preparation, analysis, and visualization in Excel Discover the landscape of AI add-ins like OpenAI API and how to use them effectively Automate routine Excel tasks using generative AI for faster, more precise results Analyze data with AI tools to uncover actionable insights and drive smarter decisions",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098190163/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098190163/160h/?format=webp"
  },
  {
    "title": "Designing AI Interfaces",
    "description": "As artificial intelligence becomes central to modern product design, UX professionals must adapt their toolkits to meet new demands. In Designing AI Interfaces, senior product designer Louise Macfadyen offers a timely, practice-oriented guide for building intuitive, ethical, and effective user experiences with large language models (LLMs) and autonomous AI systems. From content moderation to interruptibility, this book presents actionable design patterns for today's most advanced AI interactions—with clear technical insights to help designers understand how AI systems process inputs, generate outputs, and make decisions on users' behalf.Written specifically for product designers navigating the AI transition, this book provides concrete strategies for managing risk, enabling transparency, and fostering user trust in increasingly agentic systems. Readers will learn how to enable users to steer and shape AI responses in real time, incorporate ethical and UX principles into actionable design strategies, and navigate trade-offs in autonomy and control—all while gaining fluency in key AI concepts to collaborate more effectively with engineering teams.Design effective and ethical interfaces for LLMs and AI agents Apply best-practice patterns for content warnings, permissions, and oversight Gain a mental model for how AI systems reason and act Collaborate confidently with engineering and product teams Evaluate your org's AI maturity and advocate for responsible implementation",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341639812/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341639812/160h/?format=webp"
  },
  {
    "title": "Databricks Certified Generative AI Engineer Associate Study Guide",
    "description": "As generative AI becomes central to modern data and machine learning workflows, earning the Databricks Certified Generative AI Engineer Associate certification signals both credibility and technical fluency. This study guide prepares you for this sought-after certification with comprehensive coverage of core GenAI and LLM concepts, practical data management using Delta Lake, and retrieval-augmented generation (RAG) application workflows on the Databricks platform.Written by AI expert Rajaniesh Kaushikk, this book combines hands-on labs, real-world examples, and exam-aligned content to help you build and deploy effective GenAI applications. From prompt engineering and RAG-based solutions to model governance with Unity Catalog, MLflow tracking, and leveraging Hugging Face models in GenAI workflows, this guide supports both your certification journey and real-world AI development.Understand the fundamentals of generative AI, LLMs, and vector databasesPrepare and manage large-scale data using Delta Lake and the data lakehouseBuild and deploy generative AI models with Databricks and MLflowExplore RAG for enhanced model performanceImplement responsible AI practices and model governance with Unity Catalog",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623446/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623446/160h/?format=webp"
  },
  {
    "title": "Data Engineering for Multimodal AI",
    "description": "A shift is underway in how organizations approach data infrastructure for AI-driven transformation. As multimodal AI systems and applications become increasingly sophisticated and data hungry, data systems must evolve to meet these complex demands.Data Engineering for Multimodal AI is one of the first practical guides for data engineers, machine learning engineers, and MLOps specialists looking to rapidly master the skills needed to build robust, scalable data infrastructures for multimodal AI systems and applications. You'll follow the entire lifecycle of AI-driven data engineering, from conceptualizing data architectures to implementing data pipelines optimized for multimodal learning in both cloud native and on-premises environments. And each chapter includes step-by-step guides and best practices for implementing key concepts.Design and implement cloud native data architectures optimized for multimodal AI workloadsBuild efficient and scalable ETL processes for preparing diverse AI training dataImplement real-time data processing pipelines for multimodal AI inferenceDevelop and manage feature stores that support multiple data modalitiesApply data governance and security practices specific to multimodal AI projectsOptimize data storage and retrieval for various types of multimodal ML modelsIntegrate data versioning and lineage tracking in multimodal AI workflowsImplement data-quality frameworks to ensure reliable outcomes across data typesDesign data pipelines that support responsible AI practices in a multimodal context",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098190774/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098190774/160h/?format=webp"
  },
  {
    "title": "AI-Ready Data Blueprints",
    "description": "Companies innovating with generative AI understand that having the right data foundation is critical for success and profitability. To best position themselves for long-term success, organizations must prioritize investments in data and AI governance. AI-Ready Data Blueprints is your map to connecting data strategy, GenAI, and ethical practices to build and scale truly effective solutions.Taking a comprehensive, cloud-agnostic approach focused on real-world business challenges, seasoned data and AI experts Navnit Shukla, Kien Pham, Srikanth Sopirala, and Harsha Tadiparthi share actionable insights to guide you in designing and implementing effective data-centric GenAI systems. Whether you're new to GenAI or are already focusing on optimizing it for accuracy, speed, or both, the principles shared in this book will empower you to excel in all your AI endeavors.Identify the key elements of a solid data foundation for generative AIApply data governance and orchestration techniques to ensure high data quality, access control, and proper data lineage for reliable AI systemsOptimize GenAI applications through prompt engineering, fine-tuning, and retrieval-augmented generationImplement security, compliance, and governance measures, including responsible AI practices, transparency, and more",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341631786/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341631786/160h/?format=webp"
  },
  {
    "title": "Generative AI on Microsoft Azure",
    "description": "Companies are now moving generative AI projects from the lab to production environments. To support these increasingly sophisticated applications, they're turning to advanced practices such as multiagent architectures and complex code-based frameworks. This practical handbook shows you how to leverage cutting-edge techniques using Microsoft's powerful ecosystem of tools to deploy trustworthy AI systems tailored to your organization's needs.Written for and by AI professionals, Generative AI on Microsoft Azure goes beyond the technical core aspects, examining underlying principles, tools, and practices in depth, from the art of prompt engineering to strategies for fine-tuning models to advanced techniques like retrieval-augmented generation (RAG) and agentic AI. Through real-world case studies and insights from top experts, you'll learn how to harness AI's full potential on Azure, paving the way for groundbreaking solutions and sustainable success in today's AI-driven landscape.Understand the technical foundations of generative AI and how the technology has evolved over the last few yearsImplement advanced GenAI applications using Microsoft services like Azure AI Foundry, Copilot, GitHub Models, Azure Databricks, and Snowflake on AzureLeverage patterns, tools, frameworks, and platforms to customize AI projectsManage, govern, and secure your AI-enabled systems with responsible AI practicesBuild upon expert guidance to avoid common pitfalls, future-proof your applications, and more",
    "published_at": "May 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623279/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623279/160h/?format=webp"
  },
  {
    "title": "RAG with Python Cookbook",
    "description": "As businesses race to unlock the full potential of large language models (LLMs), a critical challenge has emerged: How do you connect these tools to real-time, external data to solve real-world problems? Retrieval-augmented generation (RAG) is the answer. By combining LLMs with information retrieval, RAG empowers you to build everything from intelligent chatbots to autonomous, task-solving agents. Packed with over 70 practical recipes, this go-to guide tackles a wide range of GenAI applications through structured hands-on learning. Author Dominik Polzer provides the tools you need to design, implement, and optimize RAG systems for your unique use cases. Whether you're working with simple data retrieval or designing cutting-edge autonomous agents, this cookbook will help you stay ahead of the curve. Learn core RAG components including embedding, retrieval, and generation techniques Understand advanced workflows like semantic-aware chunking and multi-query prompting Build custom solutions such as chatbots and autonomous agents for specific data challenges Continuously evaluate and optimize systems for accuracy, relevance, and performance",
    "published_at": "April 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341600553/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341600553/160h/?format=webp"
  },
  {
    "title": "Certified Cloud Security Professional (CCSP) Study Guide",
    "description": "Are you an experienced cloud security professional looking to upskill or take your career to the next level? The demand for cloud security expertise is skyrocketing and earning a Certified Cloud Security Professional (CCSP) certification is one way to demonstrate your knowledge. But preparing for the exam can be daunting. This comprehensive guide, written by industry expert Ric Messier, provides an in-depth look at the CCSP exam and covers the essential topics for today's security and cloud practitioners. With over 100 practice questions to test your understanding, this book provides clear and engaging explanations of essential concepts. So you'll not only approach the exam with confidence but also establish a firm foundation in all things cloud security—setting you up for future success. Uncover different approaches to cloud security architectures Understand risk management and compliance with cloud environments Learn essential security controls for cloud platforms and infrastructure Discover emerging trends including zero trust architecture",
    "published_at": "April 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098179410/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098179410/160h/?format=webp"
  },
  {
    "title": "Learning AutoML",
    "description": "Learning AutoML is your practical guide to applying automated machine learning in real-world environments. Whether you're a data scientist, ML engineer, or AI researcher, this book helps you move beyond experimentation to build and deploy high-performing models with less manual tuning and more automation. Using AutoGluon as a primary toolkit, you'll learn how to build, evaluate, and deploy AutoML models that reduce complexity and accelerate innovation.Author Kerem Tomak shares insights on how to integrate models into end-to-end deployment workflows using popular tools like Kubeflow, MLflow, and Airflow, while exploring cross-platform approaches with Vertex AI, SageMaker Autopilot, Azure AutoML, Auto-sklearn, and H2O.ai. Real-world case studies highlight applications across finance, healthcare, and retail, while chapters on ethics, governance, and agentic AI help future-proof your knowledge.Build AutoML pipelines for tabular, text, image, and time series dataDeploy models with fast, scalable workflows using MLOps best practicesCompare and navigate today's leading AutoML platformsInterpret model results and make informed decisions with explainability toolsExplore how AutoML leads into next-gen agentic AI systems",
    "published_at": "April 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341643178/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341643178/160h/?format=webp"
  },
  {
    "title": "Hands-On LLM Serving and Optimization",
    "description": "Large language models (LLMs) are rapidly becoming the backbone of AI-driven applications. Without proper optimization, however, LLMs can be expensive to run, slow to serve, and prone to performance bottlenecks. As the demand for real-time AI applications grows, along comes Hands-On Serving and Optimizing LLM Models, a comprehensive guide to the complexities of deploying and optimizing LLMs at scale.In this hands-on book, authors Chi Wang and Peiheng Hu take a real-world approach backed by practical examples and code, and assemble essential strategies for designing robust infrastructures that are equal to the demands of modern AI applications. Whether you're building high-performance AI systems or looking to enhance your knowledge of LLM optimization, this indispensable book will serve as a pillar of your success.Learn the key principles for designing a model-serving system tailored to popular business scenariosUnderstand the common challenges of hosting LLMs at scale while minimizing costsPick up practical techniques for optimizing LLM serving performanceBuild a model-serving system that meets specific business requirementsImprove LLM serving throughput and reduce latencyHost LLMs in a cost-effective manner, balancing performance and resource efficiency",
    "published_at": "April 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341621480/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341621480/160h/?format=webp"
  },
  {
    "title": "Large Language Models: The Hard Parts",
    "description": "Large language models (LLMs) have transformed natural language processing, but deploying them in applications introduces numerous technical challenges. Large Language Models: The Hard Partsoffers a clear, practical examination of the limitations developers and ML engineers face when building LLM-powered applications. With a focus on implementation pitfalls (not just capabilities) this book provides actionable strategies supported by reproducible Python code and open source tools.Readers will learn how to navigate key obstacles in system integration, input management, testing, safety, and cost control. Designed for engineers and technical product leads, this guide emphasizes practical solutions to real-world problems and promotes a grounded understanding of LLM constraints and trade-offs.Design testing strategies for nondeterministic systems Manage input formatting and long-context retrieval Address output inconsistency and structural unreliability Implement safety and content moderation frameworks Explore alignment challenges and mitigation techniques Leverage open source models and optimize costs",
    "published_at": "April 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341622517/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341622517/160h/?format=webp"
  },
  {
    "title": "Transformers: The Definitive Guide",
    "description": "The vast potential of AI technology remains untapped in areas like audio, video, and complex data analysis. In fact, many of today's professionals find it challenging to apply AI innovations across these diverse domains due to a lack of comprehensive guidance and practical implementations. This comprehensive guide, tailored especially for intermediate to advanced ML engineers, data scientists, and researchers, fills the gap. Author Nicole Koenigstein guides readers through the versatile applications of transformer models, not only deepening theoretical understanding but also emphasizing actionable strategies for real-world applications. You'll discover how to: Apply transformers in nontext domains like image and music generation Optimize GPU usage and model training times Deploy and monitor transformer models effectively in production environments Utilize libraries such as Ray Tune and Optuna for advanced model tuning",
    "published_at": "April 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098167004/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098167004/160h/?format=webp"
  },
  {
    "title": "Generative AI on Kubernetes",
    "description": "Generative AI is revolutionizing industries, and Kubernetes has fast become the backbone for deploying and managing these resource-intensive workloads. This book serves as a practical, hands-on guide for MLOps engineers, software developers, Kubernetes administrators, and AI professionals ready to unlock AI innovation with the power of cloud native infrastructure. Authors Roland Huß and Daniele Zonca provide a clear road map for training, fine-tuning, deploying, and scaling GenAI models on Kubernetes, addressing challenges like resource optimization, automation, and security along the way. With actionable insights with real-world examples, readers will learn to tackle the opportunities and complexities of managing GenAI applications in production environments. Whether you're experimenting with large-scale language models or facing the nuances of AI deployment at scale, you'll uncover expertise you need to operationalize this exciting technology effectively. Learn to run GenAI models on Kubernetes for efficient scalability Get techniques to train and fine-tune LLMs within Kubernetes environments See how to deploy production-ready AI systems with automation and resource optimization Discover how to monitor and scale GenAI applications to handle real-world demand Uncover the best tools to operationalize your GenAI workloads Learn how to run agent-based and AI-driven applications",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098171919/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098171919/160h/?format=webp"
  },
  {
    "title": "Cilium: Up and Running",
    "description": "Cilium is now considered the de facto cloud native networking platform for Kubernetes, connecting, securing, and monitoring millions of applications across thousands of clusters. With such versatility and feature-richness, Cilium can be daunting to learn. This comprehensive guide breaks Cilium down, making it broadly accessible to the increasing number of users who'll encounter the platform in their careers.Nico Vibert, Filip Nikolic, and James Laverack, all from Isovalent (creators of eBPF and Cilium), take you through how Cilium works, the problems it can solve, and how to run it in production. If you're an experienced platform engineer or network architect who wants to get on top of the next big thing in cloud networking, this book is for you.Learn about Kubernetes networking and the role of CiliumDive into the various use cases Cilium addressesUnderstand Cilium's architecture and how it moves packets aroundSecure workloads through the use of network policiesConnect multiple clusters for service load balancing and discoveryObserve application networking performance for troubleshooting and forensicsLeverage Cilium's built-in service mesh and networking capabilities for complex traffic engineering",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341622982/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341622982/160h/?format=webp"
  },
  {
    "title": "Real-Time Intelligence with Microsoft Fabric",
    "description": "In today's hyper-connected world, many organizations are overwhelmed by the volume of data generated every second. Making timely decisions using this information remains a challenge for many. Real-time intelligence has transformed from a luxury to a necessity for businesses striving to stay ahead in a rapidly evolving marketplace. Enter Microsoft Fabric's Real-Time Intelligence: a new tool that not only analyzes data but also acts upon the results. If you're ready to unlock the power of immediate insights, this comprehensive primer offers an exploration into the capabilities of Real-Time Intelligence with Microsoft Fabric. Authors Johan Ludvig Brattås and Frank Geisler explain AI-driven insights and how to use them to drive business success. Whether you're a seasoned professional or an enthusiast, this guide is the key to understanding an exciting new platform. You'll discover: The core concepts of Real-Time Intelligence within Microsoft Fabric Challenges that can be solved with Real-Time Intelligence, enhancing efficiency Techniques for using KQL queries, including SQL knowledge to optimize these queries Practical applications including data analytic solutions, event streams, and more How to automatically trigger actions based on data conditions",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098178574/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098178574/160h/?format=webp"
  },
  {
    "title": "Introducing C++",
    "description": "You know how to code, but you're ready to level up. You've heard about the power and performance of C++, a language vital to fields like AI, game development, and high-performance computing. But where do you even start? Existing resources are either outdated, overly academic, or assume a deep understanding of C. You need a guide that respects your existing skills and gets you coding fast with modern C++. This book cuts through the noise, focusing on the essential elements of C++ with hands-on projects that quickly build your skills and confidence. Author and C++ expert Frances Buontempo gets you up to speed quickly with the latest features and best practices of the language, preparing you for more advanced exploration. Write clean and efficient C++ code Understand core concepts and syntax Apply various programming approaches, from OOP to functional styles Read and understand complex C++ definitions and resources",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098178130/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098178130/160h/?format=webp"
  },
  {
    "title": "Observability Engineering, 2nd Edition",
    "description": "Observability is the only way to engineer, manage, and improve the business-critical systems that customers depend on every day—and as the complexity of software grows, so does the need for observability. With this thoroughly revised second edition, authors Charity Majors, Liz Fong-Jones, and George Miranda take inventory of the current state of the field and explain how practitioners can evolve their observability practices from collecting separate, disparate signals to unified data workflows.This book is for any software engineering team, large or small, that must understand the unique customer experience in order to ship quality code and features that customers want, at the right velocity. You'll discover the value that observable systems bring and learn concrete steps you can follow to achieve an observability-driven development practice yourself. And four completely new chapters explore recent trends such as large language models, frontend observability, cost optimization/performance engineering, and practical open source tooling.Understand the impact observability has across the entire software development lifecycleLearn how and why different functional teams use observability with service-level objectivesImplement modern observability practices in your organizationMaximize the cost-effectiveness of observability toolingProduce quality code for context-aware system debugging and maintenanceUse data-rich analytics to quickly find answers when maintaining site reliability",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098179915/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098179915/160h/?format=webp"
  },
  {
    "title": "Agentic Mesh",
    "description": "With the rise of autonomous agents, the question is no longer \"How do we build agents?\" but rather, \"How do we manage an entire ecosystem of them?\" This book explores the next frontier of this technology, where interconnected agents collaborate, transact, and fulfill tasks autonomously. Building on established concepts like API service mesh and data mesh, authors Eric and Davis Broda introduce agentic mesh as a transformative architecture designed to safely manage growing ecosystems of agents at scale.This practical guide unpacks how agentic mesh works, explains its key components—such as agent registries, marketplaces, trust-building mechanisms, and human-in-the-loop oversight—and illustrates how agents can discover, interact, and transact with ease. Through accessible explanations and compelling use cases, you'll gain a clear understanding of how to implement and govern agent ecosystems, ensuring security, transparency, and efficiency. Whether you're a tech leader, developer, or enterprise strategist, Agentic Mesh provides a road map to navigate the future of autonomous agents with confidence.Understand the concept of agentic mesh and its transformative potentialLearn how autonomous agents find, collaborate, and transact within a mesh ecosystemExplore critical components like agent registries, marketplaces, and trust frameworksAddress safety, security, and governance challenges in agent ecosystemsApply practical use cases to begin designing and implementing your own agentic mesh",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341621633/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341621633/160h/?format=webp"
  },
  {
    "title": "Microsoft Fabric Analytics Engineer Associate Study Guide",
    "description": "Data is the heartbeat of business. Microsoft's Fabric Analytics Engineer Associate (DP-600) certification proves you understand the tools and technologies to make use of it. This comprehensive guide covers everything you need to know to design and implement enterprise-grade analytics solutions—and ace your certification exam.Drawing on their extensive experience working with Microsoft Fabric and Power BI, Brian Bønk and Valerie Junk take you through preparing and transforming data, securing and managing analytics assets, and building and optimizing semantic models. You'll learn to work with data warehouses and lakehouses, ensuring data is structured and ready for analysis. You will also discover how to query and analyze data using SQL, KQL, and DAX, which are essential skills for anyone working with Fabric.Whether you're preparing for the exam or just looking to expand your Fabric expertise, this book gives you the foundation to succeed.Prepare and enrich data for analysisWork with, secure, and maintain analytics assetsImplement and manage semantic modelsUtilize data warehouses and lakehousesHandle workspace access control and item-level access controlOptimize enterprise-scale semantic models",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341634800/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341634800/160h/?format=webp"
  },
  {
    "title": "Vector Databases",
    "description": "The AI revolution is here, and at its core lies a game-changing technology that most developers haven't fully explored: vector databases. From powering semantic search to enabling large language models (LLMs) and generative AI, vector databases are reshaping how we build applications with unstructured data like text, images, and audio. But how do you go from curious to capable with this vital technology? That's where this book comes in. In this hands-on guide, author Nitin Borwankar takes you through the \"why, what, and how\" of vector databases, starting with the basic theory behind vector embeddings and progressing to building applications with real-world tools. You'll learn about Word2vec, how to convert open source SQL databases like SQLite3 and PostgreSQL into vector databases, and integrate them into retrieval-augmented generation (RAG) applications. Whether you're a Python developer, data engineer, or ML practitioner, this book gives you the foundation to leverage vector databases confidently in your AI projects. Understand the connection between vector databases, embeddings, and LLMs Learn practical approaches for transforming SQL databases into vector databases Build RAG applications for both personal and enterprise use Apply vector databases to solve real-world AI challenges Learn how to use vector databases with LLMs to build applications",
    "published_at": "March 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098177584/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098177584/160h/?format=webp"
  },
  {
    "title": "Designing Data-Intensive Applications, 2nd Edition",
    "description": "Data is at the center of many challenges in system design today. Difficult issues such as scalability, consistency, reliability, efficiency, and maintainability need to be resolved. In addition, there's an overwhelming variety of tools and analytical systems, including relational databases, NoSQL datastores, plus data warehouses and data lakes. What are the right choices for your application? How do you make sense of all these buzzwords? In this second edition, authors Martin Kleppmann and Chris Riccomini build on the foundation laid in the acclaimed first edition, integrating new technologies and emerging trends. You'll be guided through the maze of decisions and trade-offs involved in building a modern data system, from choosing the right tools like Spark and Flink to understanding the intricacies of data laws like the GDPR. Peer under the hood of the systems you already use, and learn to use them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098119058/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098119058/160h/?format=webp"
  },
  {
    "title": "Certified Kubernetes Administrator (CKA) Study Guide, 2nd Edition",
    "description": "The ability to administer and monitor a Kubernetes cluster is in high demand. Those who want to demonstrate their credibility and value in the job market hold the Cloud Native Computing Foundation's Certified Kubernetes Administrator (CKA) certification—proving they can confidently work in a Kubernetes environment.The CKA certification exam isn't the typical multiple-choice format of other professional certifications. Instead, it's performance-based, requiring deep knowledge of the tasks under immense time pressure. And the exam has been overhauled for 2025, with an updated curriculum focused on a revised list of competencies. New topics include: Custom Resource Definitions (CRDs) and Operators, the Gateway API, and more.This updated study guide walks you through all the topics covered to fully prepare you for the exam, including new sections reflecting the recent changes. Author Benjamin Muschko also shares his personal experience with preparing for all aspects of the exam.Learn when and how to apply Kubernetes concepts to administer and troubleshoot a production-grade clusterUnderstand the objectives, abilities, and tips and tricks needed to pass the CKA examExplore the ins and outs of the kubectl command-line toolDemonstrate competency to perform the responsibilities of a Kubernetes administratorSolve real-world Kubernetes problems in a hands-on command-line environmentEffectively navigate and solve questions during the CKA exam",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341608399/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341608399/160h/?format=webp"
  },
  {
    "title": "Microsoft Power BI Data Analyst Associate Study Guide",
    "description": "Passing the PL-300 exam with 2025 revisions isn't just about memorization—you need to thoroughly know the basic features of Power BI. However, data professionals must also apply best practices that make Power BI solutions scalable and future-proof. The first half of this go-to companion by Paul Turley provides complete coverage of the PL-300 exam objectives for desktop and self-service users, while the second half equips you with necessary best practices and practical skills for real-world success after the exam. Immerse yourself in exam prep, practice questions, and hands-on references for applying time-tested design patterns in Power BI. You'll learn how to transform raw data into actionable insights using Power Query, DAX, and dimensional modeling. Perfect for data analysts and business intelligence developers, this guide shows how Power BI fits into modern data platforms like Azure and Microsoft Fabric, preparing you for the exam and for the evolving world of data engineering. Understand PL-300 exam topics and key prep strategies Discover scalable, enterprise-grade Power BI solutions using best practices Learn how to correctly apply Power Query, DAX, and visualizations in real-world scenarios, with real business data Uncover how to build for scale See how Power BI fits into modern architectures like Azure and Microsoft Fabric",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098175276/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098175276/160h/?format=webp"
  },
  {
    "title": "Learning Ransomware Response & Recovery",
    "description": "Ransomware attacks are no longer a question of if—it's a matter of when. With hackers increasingly targeting backup and disaster recovery (DR) systems, organizations need more than prevention strategies; they need a battle-tested plan for minimizing damage, forensically determining what's happened and restoring your environment without paying the ransom. Renowned experts W. Curtis Preston and Dr. Mike Saylor offer a comprehensive guide to protecting critical systems and responding effectively when the worst happens. Whether you're a security professional unaware of how exposed your backup systems are, or a backup admin in need of stronger security expertise, this book is your essential roadmap. With actionable advice, clear frameworks, and step-by-step guidance, it bridges the gap between data protection and cybersecurity—empowering teams to deliver decisive, effective responses when faced with ransomware. Prevent 90% of ransomware attacks with practical, simple steps Shield your backup systems from also being a victim of the attack Minimize the blast radius of attacks on your infrastructure Identify, isolate, and restore compromised systems with confidence Develop and test a detailed incident response plan",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098169572/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098169572/160h/?format=webp"
  },
  {
    "title": "Web Performance Engineering in the Age of AI",
    "description": "On today's web, performance isn't just a nice-to-have—it's essential. A slow or unstable experience drives users away, while a fast, reliable one builds trust and keeps them engaged. Web Performance Engineering is a comprehensive, hands-on guide for developers, technical leads, and performance engineers focused on delivering high-impact, user-first web experiences. Written by Addy Osmani, an engineering leader on the Google Chrome team, this book combines deep technical insight with a strong emphasis on usability and real-world effectiveness.Through case studies, modern optimization techniques, and a user-centered approach, you'll learn how to identify bottlenecks, debug performance issues, and apply improvements that make a measurable difference. Grounded in current browser internals and performance metrics, this book prepares you to design and maintain faster, more resilient websites at scale.Understand how users perceive speed—and why it mattersEvaluate and improve performance using key metricsOptimize for stability, responsiveness, and load timeIdentify and address the most common performance bottlenecksApply real-world strategies that lead to lasting results",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341660182/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341660182/160h/?format=webp"
  },
  {
    "title": "Demystifying The Coding Interview",
    "description": "Coding interviews can be perplexing, often focusing more on problem-solving skills than the coding itself. For many aspiring programmers, understanding how to approach these interviews remains a significant hurdle in landing their dream job. Whether you're a novice hoping to break into the tech industry or a seasoned coder aiming for a promotion, it's important to ensure you're fully prepared to tackle any algorithmic challenge to land the role you want. This essential guide is your key to conquering coding interviews. Written by longtime coder and educator Dave Kanter, this book covers the kinds of problems you can expect to face and the critical thinking, problem-solving, and technical skills needed to solve them. Whether it's understanding complex data structures or mastering tricky algorithmic concepts, this book offers tangible methods and strategies to enhance your problem-solving prowess and boost your confidence. By reading, you'll: Learn how to create a targeted study plan that sets you up for success Familiarize yourself with common coding interview problems and the best strategies to tackle them Work through real-world questions with detailed solutions to sharpen your skills Gain an understanding of essential concepts and how to apply them under pressure Equip yourself to impress interviewers and stand out from the competition",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098173647/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098173647/160h/?format=webp"
  },
  {
    "title": "Azure Fundamentals (AZ-900) Study Guide",
    "description": "Cloud computing is no longer just a buzzword but a crucial skill set for today's professionals. The ability to navigate the complexities of cloud technologies and understand the Azure environment is a significant advantage. Whether you're starting your tech journey or looking to solidify your foundational knowledge, this study guide is your essential resource to mastering these critical concepts and achieving Azure certification. Author Jack Lee (Microsoft MVP) will thoroughly prepare you for the AZ-900 Azure Fundamentals exam. Going beyond the exam material, you'll become immersed in the world of Azure, acquiring the tools to understand and effectively utilize cloud and Azure foundational concepts. From exploring key cloud principles like high availability and scalability to delving into Azure's core services and management tools, this book provides both detailed explanations and key insights. Grasp the basics of cloud computing, including different service types, pricing models, and deployment strategies Learn to identify and describe the core Azure services and understand their practical applications in real-world scenarios See study tips, practice questions, and quizzes designed to mirror the AZ-900 exam format Receive expert advice to confidently undertake the exam and apply your knowledge in your day-to-day work",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098167813/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098167813/160h/?format=webp"
  },
  {
    "title": "The Effective Software Engineer",
    "description": "The software engineering landscape is constantly evolving, and the demands on engineers intensify with each technological and methodological shift. In such an environment, being a good coder isn't enough—true effectiveness goes beyond technical skills.This book is designed as a guide for individual contributors who want to level up to meet the challenges of a changing industry. Author Addy Osmani offers a trove of actionable insights, real-world examples, practical frameworks, and pragmatic advice drawn from years of experience (and plenty of mistakes) in the software industry. You'll learn the fundamental skills every effective engineer needs, as well as the strategic thinking and leadership that distinguishes senior and staff engineers. The Effective Software Engineer is a perennial resource for those who are committed to the ongoing process of learning, adapting, and striving to make a meaningful difference.Connect your work to the overall goals of your team and organizationIdentify the most important tasks and avoid distractionsWork effectively with your team, stakeholders, and usersNavigate the evolving technology landscape, including AI tools, while focusing on uniquely human contributionsTackle complex challenges and make sound technical choicesStay relevant and adapt to change through continuous learning and growthBalance code quality with delivery speed while managing technical debt strategically",
    "published_at": "February 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341638167/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341638167/160h/?format=webp"
  },
  {
    "title": "Engineering Leadership: The Hard Parts",
    "description": "Whether they're building a startup or scaling an established org, engineering leaders know the real job is keeping chaos at bay. In a world of shifting priorities, scarce resources, and rapid change, leadership means embracing the unknown, managing moving targets, and creating clarity where there's none. Sometimes, you're building the plane as you're flying it—writing the roadmap as you go, designing processes in real time.Engineering Leadership: The Hard Parts cuts through the noise, offering a guide for tackling these gritty, real-world challenges. Current and future leaders, this is your toolkit. It's packed with principles, techniques, and mental models for thriving in uncertainty.Navigate the full scope: Step into engineering leadership's complex, multifaceted roleBuild high-impact teams: Master advanced techniques to grow and lead your technical talentAlign and execute: Connect strategy to business outcomes, scale effectively, and balance innovation with precisionLead with resilience: Adapt quickly and drive continuous improvementAccelerate your career: Develop your leadership edge and unlock new growthStay ahead. Lead with purpose.",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098175627/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098175627/160h/?format=webp"
  },
  {
    "title": "UX Skills for Business Strategy",
    "description": "Today's design leaders and UX professionals are faced with a growing challenge: How do you choose the right UX skills to meet critical business goals, while proving their value to stakeholders? This book presents your solution, offering a clear, actionable framework for linking UX decisions directly to your company's bottom line. Authors Torrey Podmajersky, Maya Elise Joseph-Goteiner, and Kim Mats Mats give you practical insights, real-world examples, and over 100 UX skills —everything you need to align your design approaches with business outcomes. Whether it's optimizing productivity, boosting revenue, or enhancing user satisfaction, you'll learn how to select the right tool for the job, measure its effectiveness, and confidently articulate value to your team and executives. Learn to match UX skills to specific business objectives Uncover which business metrics to track and report when implementing UX strategies Effectively communicate the value of UX to stakeholders Prioritize the most impactful UX solutions for your organization Demonstrate the measurable business outcomes produced by your UX efforts",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098177867/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098177867/160h/?format=webp"
  },
  {
    "title": "Learning Serverless Security",
    "description": "Despite the increased adoption of serverless computing services around the world, a big gap still exists when it comes to serverless security knowledge and expertise. This gap comes with a steep price: the increased risk of data breaches as more companies store their data in the cloud. This practical guide covers the relevant offensive and defensive security techniques to audit and secure serverless applications running on AWS, Azure, and Google Cloud. You'll learn how to attack and defend a variety of vulnerable serverless applications using the step-by-step instructions. By the end of this book, you'll have a solid understanding on how to prevent a variety of serverless application attacks and privilege escalation techniques. Author Joshua Arvin Lat, chief technology officer at NuWorks Interactive Labs and AWS Machine Learning Hero, shows you how to: Identify and exploit vulnerabilities within modern serverless applications Perform privilege escalation techniques in cloud environments Use automated tools and services for offensive and defensive security Configure authentication and identity services properly on AWS, Azure, and Google Cloud Implement security strategies and best practices to prevent a variety of serverless application attacks Audit serverless environments using a variety of security tools and frameworks",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098149000/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098149000/160h/?format=webp"
  },
  {
    "title": "Tidy Together",
    "description": "Messy systems slow progress and increase costs—but tidying up isn't just an individual effort, it's a team responsibility. In this essential guide, author Kent Beck offers a practical framework for improving system design collaboratively. Building on the ideas from Tidy First?, this book shows teams how to balance changes to a system's behavior with improvements to its structure, ensuring smoother development, faster progress, and more effective collaboration. With a focus on teamwork, this book emphasizes not just fixing code but strengthening the human relationships that sustain system evolution.Through thoughtful insights, real-world examples, and actionable practices, Beck teaches teams to alternate between tidying and building, minimizing risk while maintaining momentum. Learn how to make large changes safely, refine your team dynamics, and clear the path to sustainable system improvements with approaches that prioritize both people and code. Whether you're an individual contributor or leading a design team, you'll be equipped to design better systems—together.Understand the difference between changes to system behavior and structureLearn the power of alternating investments between tidying and buildingApply small, safe steps to execute large system changesStrengthen team relationships to sustain healthy design practicesPrepare for design challenges shaped by diverging incentives and human collaboration",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098178758/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098178758/160h/?format=webp"
  },
  {
    "title": "AWS Certified Cloud Practitioner (CLF-C02) Study Guide",
    "description": "Cloud computing continues to drive innovation across industries, fueling advancements like digital transformation, scalability, and the rise of artificial intelligence. Amazon Web Services is at the forefront of this evolution, and the AWS Certified Cloud Practitioner certification is the perfect entry point for anyone looking to build a strong foundation in cloud technology.This comprehensive study guide helps you thoroughly prepare for the exam, covering cloud computing principles, AWS's global infrastructure, security best practices, pricing and billing models, and more. It also affords opportunities for hands-on practice with AWS services such as EC2, S3, RDS, and Lambda and includes test-taking strategies and a wide range of practice questions. Whether you're an IT professional, business manager, or aspiring cloud practitioner, this book will serve as your essential companion on the path to certification. Understand the fundamental concepts of cloud computing and their relevance to AWSExplore AWS's tools and services for business applicationsLearn design principles and best practices for building secure, high-performing, resilient, and efficient infrastructure on AWSApply cloud concepts and principles in real-world scenarios using AWS",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341640214/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341640214/160h/?format=webp"
  },
  {
    "title": "Privacy and Security for Large Language Models",
    "description": "As the deployment of AI technologies surges, the need to safeguard privacy and security in the use of large language models (LLMs) is more crucial than ever. Professionals face the challenge of leveraging the immense power of LLMs for personalized applications while ensuring stringent data privacy and security. The stakes are high, as privacy breaches and data leaks can lead to significant reputational and financial repercussions. This book serves as a much-needed guide to addressing these pressing concerns. Dr. Baihan Lin offers a comprehensive exploration of privacy-preserving and security techniques like differential privacy, federated learning, and homomorphic encryption, applied specifically to LLMs. With its hands-on code examples, real-world case studies, and robust fine-tuning methodologies in domain-specific applications, this book is a vital resource for developing secure, ethical, and personalized AI solutions in today's privacy-conscious landscape.By reading this book, you'll: Discover privacy-preserving techniques for LLMsLearn secure fine-tuning methodologies for personalizing LLMsUnderstand secure deployment strategies and protection against attacksExplore ethical considerations like bias and transparencyGain insights from real-world case studies across healthcare, finance, and moreExamine the legal and cultural landscape of AI deployment",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098160838/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098160838/160h/?format=webp"
  },
  {
    "title": "ML and Generative AI in the Data Lakehouse",
    "description": "In today's race to harness generative AI, many teams struggle to integrate these advanced tools into their business systems. While platforms like GPT-4 and Google's Gemini are powerful, they aren't always tailored to specific business needs. This book offers a practical guide to building scalable, customized AI solutions using the full potential of data lakehouse architecture. Author Bennie Haelen covers everything from deploying ML and GenAI models in Databricks to optimizing performance with best practices. In this must-read for data professionals, you'll gain the tools to unlock the power of large language models (LLMs) by seamlessly combining data engineering and data science to create impactful solutions.Learn to build, deploy, and monitor ML and GenAI models on a data lakehouse architecture using Databricks Leverage LLMs to extract deeper, actionable insights from your business data residing in lakehouses Discover how to integrate traditional ML and GenAI models for customized, scalable solutions Utilize open source models to control costs while maintaining model performance and efficiency Implement best practices for optimizing ML and GenAI models within the Databricks platform",
    "published_at": "January 2026",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098178482/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098178482/160h/?format=webp"
  },
  {
    "title": "Practical Guide to Modern Networking Telemetry",
    "description": "Unlock the power of your network with network telemetry. By gathering, wrangling, and analyzing in-depth data about your network, you'll gain the understanding you need to proactively manage it, optimize its performance, and ensure a smooth digital experience for users. This handy, easy-to-digest technical guide offers a comprehensive overview of network telemetry, illustrated through real-world use cases that network professionals encounter daily.Authors Avi Freedman and Leon Adato take you through the various data formats used to analyze traffic flow, device health, and configurations, including data from routers, servers, and even Internet of Things devices. You'll also explore practical applications, like performance monitoring, efficient troubleshooting, and informed cloud migration planning, that will help you make data-driven decisions for optimal performance and security.Understand the wide variety network telemetry sources and the different architectural \"planes\" devices are monitored onExplore the different types of network telemetry, from traffic data, device metrics, and events to operational dataWrangle telemetry data, replicate data to analytics systems, feed broader observability systems, and evaluate data system requirements and trade-offsUse network telemetry effectively for various purposes, such as monitoring digital experience, troubleshooting performance issues, defending against attacks, and more",
    "published_at": "December 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341608917/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341608917/160h/?format=webp"
  },
  {
    "title": "Cloud Native Geospatial Analytics with Apache Sedona",
    "description": "Navigating the complexities of large-scale spatial data can be daunting. In order to unleash the power of massive and complex datasets, you'll need a cutting-edge tool like Apache Sedona. This innovative distributed computing system, designed specifically for spatial data, has diverse applications in fields such as mobility, telematics, agriculture, climate science, and more. This book serves as your guide to leveraging this tool, along with other technologies, to unlock the potential of geospatial analytics. Authors Pawel Tokaj, Jia Yu, and Mo Sarwat provide practical solutions to the challenges of working with geospatial data at scale. Ideal for developers, data scientists, engineers, and analysts, this guide uses real-world examples to help you integrate Python data ecosystems, apply machine learning, construct geospatial data lakehouses, and handle modern geospatial data formats like GeoParquet. Understand how Apache Sedona helps data practitioners address challenges with geospatial data Learn how to run Apache Sedona, both locally and in cloud environments Efficiently load, query, and analyze geospatial datasets using spatial SQL Employ machine learning techniques to derive strategy-defining insights from spatial data Manage and optimize large-scale geospatial data within a data lakehouse architecture",
    "published_at": "December 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098173982/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098173982/160h/?format=webp"
  },
  {
    "title": "Azure Data Fundamentals",
    "description": "Learn the essential skills and concepts for working with data in the cloud using Microsoft Azure. With this practical guide, professionals new to data management and Azure will learn how to leverage Azure services such as Azure Cosmos DB, Azure Storage, Azure SQL, and Microsoft Fabric to create, store, process, analyze, and visualize data. Author Michael John Pena, data and AI director at Playtime Solutions, also shows you how to apply security, monitoring, and optimization techniques to your data solutions in Azure. Ideal as a resource for the Azure Data Fundamentals certification, this book also provides knowledge you can apply in your daily work even after platforms evolve and new technologies emerge. You'll gain insightful experience that will help you apply the fundamentals of data operations and engineering in the Azure ecosystem. Learn core data concepts and correlating Microsoft Azure data services Discover how to work with relational and nonrelational data on Azure Build data analytics solutions using various Azure data services Identify and describe core data workloads and data analytics workloads on Azure Describe how to work with data security and privacy on Azure Explain the use cases, benefits, and limitations of different Azure data services",
    "published_at": "December 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098164720/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098164720/160h/?format=webp"
  },
  {
    "title": "GenAI on Google Cloud",
    "description": "In today's AI landscape, success depends not just on using large language models but on moving them into production in a way that's scalable, compliant, and cost-effective. GenAI on Google Cloud: Enterprise Generative AI Systems and Agents is your hands-on guide to bridging that gap. Whether you're an ML engineer tackling your first multi-agent application or a product leader responsible for scaling a GenAI strategy, this book offers a practical game plan for taking your LLM applications from promising prototype to enterprise-grade solution.Written by practitioners with deep experience in MLOps, data engineering, and GenAI infrastructure, this guide takes you through real-world workflows using Google Cloud's Vertex AI—from training and deployment to monitoring and integration. With concrete examples, field-tested frameworks, and honest insights about what actually works, you'll learn how to build production systems that deliver measurable business value.Bridge the prototype-to-production chasm that stalls 75% of LLM projects using systematic frameworks developed across hundreds of deploymentsNavigate the unique complexities of LLM operations through practical guidance on data orchestration, evaluation frameworks, and responsible AI practicesBuild enterprise-grade multimodal systems that handle text, images, and video with robust agent architectures and tool integrationImplement proven optimization strategies for cost management, performance tuning, and production monitoring at scaleApply battle-tested patterns from practitioners who've guided organizations through both breakthrough successes and costly failures",
    "published_at": "December 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341623842/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341623842/160h/?format=webp"
  },
  {
    "title": "Leveling Up as a Tech Lead",
    "description": "The tech lead role is one of the most pivotal—and puzzling—in the tech world. Are you a coder at heart? A project manager in disguise? A mentor, strategist, or problem-solver-in-chief? The truth is, you're often all of these rolled into one. Yet, with so few resources tailored to this multifaceted role, many tech leads find themselves navigating a sea of expectations and constant challenges without a clear map. This book serves as your definitive guide, helping you cut through the confusion, understand the unique demands of the role, and tackle each responsibility with confidence and clarity. Whether you're an aspiring tech lead exploring your next step, a new lead seeking strategies to navigate the steep learning curve, or an experienced leader refining your approach, you'll benefit from the actionable advice and real-world examples this book offers. Author Anemari Fiser shares insights on how to balance competing priorities, foster team collaboration, and lead with impact—empowering you to stop merely surviving and start thriving.Understand the challenges and varying expectations of the tech lead role Develop strategies for managing teams, aligning projects, and making decisions Strengthen core soft skills like mentoring, communication, and conflict resolution Apply tools to balance technical problem-solving with people leadership Build a personalized growth plan for sustainable career development Refine your leadership approach to foster high-performing, collaborative teams",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098177508/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098177508/160h/?format=webp"
  },
  {
    "title": "Building Machine Learning Systems with a Feature Store",
    "description": "Get up to speed on a new unified approach to building machine learning (ML) systems with batch data, real-time data, and large language models (LLMs) based on independent, modular ML pipelines and a shared data layer. With this practical book, data scientists and ML engineers will learn in detail how to develop, maintain, and operate modular ML systems. Author Jim Dowling introduces fundamental MLOps principles and practices for developing and operating reliable ML systems and describes the key data platform that you'll use to build and operate your ML systems: the feature store. Through examples, you'll look at how the feature store helps solve the hardest problem in ML—the data. When building systems, you'll move seamlessly from managing incremental datasets for training and fine-tuning to real-time data access and retrieval-augmented generation for online ML systems. With this book, you'll be able to: Make the leap from training ML models to building ML systems Develop an ML system as modular feature, training, and inference pipelines Design, develop, and operate batch ML systems, real-time ML systems, and fine-tuned LLM systems with retrieval-augmented generation Learn the problems a feature store for ML solves when building ML systems Understand the principles of MLOps for developing and safely updating ML systems Jim Dowling is CEO of Hopsworks and an associate professor at KTH Royal Institute of Technology in Stockholm, Sweden.",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098165222/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098165222/160h/?format=webp"
  },
  {
    "title": "Apache Hudi: The Definitive Guide",
    "description": "Overcome challenges in building transactional guarantees on rapidly changing data by using Apache Hudi. With this practical guide, data engineers, data architects, and software architects will discover how to seamlessly build an interoperable lakehouse from disparate data sources and deliver faster insights using their query engine of choice. Authors Shiyan Xu, Prashant Wason, Sudha Saktheeswaran, and Rebecca Bilbro provide practical examples and insights to help you unlock the full potential of data lakehouses for different levels of analytics, from batch to interactive to streaming. You'll also learn how to evaluate storage choices and leverage built-in automated table optimizations to build, maintain, and operate production data applications. This book helps you: Understand the need for transactional data lakehouses and the challenges associated with building them Get up to speed with Apache Hudi and learn how it makes building data lakehouses easy Explore data ecosystem support provided by Apache Hudi for popular data sources and query engines Perform different write and read operations on Apache Hudi tables and effectively use them for various use cases, including batch and stream applications Implement data engineering techniques to operate and manage Apache Hudi tables Apply different storage techniques and considerations, such as indexing and clustering to maximize your lakehouse performance Build end-to-end incremental data pipelines using Apache Hudi for faster ingestion and fresher analytics",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098173821/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098173821/160h/?format=webp"
  },
  {
    "title": "Data Contracts",
    "description": "Poor data quality can cause major problems for data teams, from breaking revenue-generating data pipelines to losing the trust of data consumers. Despite the importance of data quality, many data teams still struggle to avoid these issues—especially when their data is sourced from upstream workflows outside of their control. The solution: data contracts. Data contracts enable high-quality, well-governed data assets by documenting expectations of the data, establishing ownership of data assets, and then automatically enforcing these constraints within the CI/CD workflow. This practical book introduces data contract architecture with a clear definition of data contracts, explains why the data industry needs them, and shares real-world use cases of data contracts in production. In addition, you'll learn how to implement components of the data contract architecture and understand how they're used in the data lifecycle. Finally, you'll build a case for implementing data contracts in your organization. Authors Chad Sanderson and Mark Freeman will help you: Explore real-world applications of data contracts within the industry Understand how to apply each component of this architecture, such as CI/CD, monitoring, version control data, and more Learn how to implement data contracts using open source tools Examine ways to resolve data quality issues using data contract architecture Measure the impact of implementing a data contract in your organization Develop a strategy to determine how data contracts will be used in your organization",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098157623/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098157623/160h/?format=webp"
  },
  {
    "title": "The Product-Minded Engineer",
    "description": "In the fast-paced world of software engineering, developing technical skills often takes precedence. However, if you're seeking career advancement, enhancing your technical skills alone is not enough; you also need to deepen your empathy for users—a skill frequently overlooked in traditional engineering roles. Understanding user needs and the broader impact of your work will not only lead to better products but will also help your career grow and flourish. Drawing on over 20 years of experience, including in roles at Microsoft, Facebook, and Stripe, author Drew Hoskins guides you through the essential strategies to bridge the gap between engineering prowess and product insight. Whether you're building consumer products, tools for professionals, or internal platforms, this book is your gateway to becoming a well-rounded engineer who anticipates and innovates according to user needs. By the end of this book, you will learn to: Simulate and predict user interactions to enhance product usability Sharpen your focus on the specific needs of your target audience Engage with users effectively to gather impactful feedback Integrate product thinking seamlessly into your technical tasks Design features that minimize user issues and maximize benefits",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098173722/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098173722/160h/?format=webp"
  },
  {
    "title": "Fundamentals of Software Engineering",
    "description": "What do you need to know to be a successful software engineer? Undergraduate curricula and bootcamps may teach the fundamentals of algorithms and writing code, but they rarely cover topics vital to your career advancement. With this practical book, you'll learn the skills you need to succeed and thrive. Authors Nathaniel Schutta and Dan Vega guide your journey with pointers to deep dives into specific topic areas that will help you understand the skills that really matter as a software engineer. With this book, you'll: Understand what software engineering is—and why communication and other soft skills matterLearn the basics of software architecture and architectural driversUse common and proven techniques to read and refactor code basesUnderstand the importance of testing and how to implement an effective test suiteLearn how to reliably and repeatedly deploy softwareKnow how to evaluate and choose the right solution or tool for a given problem",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098143220/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098143220/160h/?format=webp"
  },
  {
    "title": "Structured for Intelligence",
    "description": "As enterprises embed AI and agents into everything from customer experiences to internal operations, a new challenge is emerging: Structured data—the foundation of operational and analytical systems—must now be discoverable, governed, and provisioned in ways that AI can understand and reliably act on.Authors Tom Taulli, Jason Ganz, and Tom Grabowski examine the rise of structured data interfaces: systems that expose data assets to AI with the right metadata, lineage, permissions, and context. You'll learn how to use these interfaces to enable trusted decision-making, automation, and augmentation and unlock the value of your data in an AI-first world.The future of data engineering isn't about doing less. It's about doing more of what truly matters. This report equips you with a framework for understanding how your data architectures must adapt to support this next wave of innovation.Learn why structured data is critical for safe, effective AI system interactionExplain the strategic importance of structured data access to technical and business stakeholdersEvaluate your organization's data infrastructure through the lens of AI readinessIdentify gaps in discoverability, governance, and provisioning for AI-driven use casesFrame requirements for vendor evaluation or internal tooling around AI-data integrationPlan a roadmap for enabling LLMs to safely interact with structured enterprise data",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341653009/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341653009/160h/?format=webp"
  },
  {
    "title": "Domain-Driven Transformation",
    "description": "Legacy systems slow down innovation, increase maintenance costs, and create misalignment between business goals and technical delivery. Domain-Driven Transformation offers a clear, risk-aware path to modernizing complex applications using principles from domain-driven design (DDD) and modular architecture. Authors Carola Lilienthal and Henning Schwentner guide software architects, technical leads, and senior engineers through practical, incremental strategies to evolve legacy systems without the disruption of a full rewrite.With a focus on collaboration, modularity, and strategic refactoring, this book helps you assess architectural maturity using the modularity maturity index (MMI) and identify transformation opportunities through modeling techniques like event storming and domain storytelling. Packed with real-world examples and case-driven insights, you'll uncover the tools needed to build systems that scale, support business agility, and remain resilient over time.Assess your system's modularity and architectural health with the MMIApply strategic and tactical DDD to manage complexityBreak apart monolithic systems into domain-aligned componentsUse collaborative modeling techniques to align teams and clarify designRefactor incrementally with patterns that reduce risk while delivering value",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341640108/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341640108/160h/?format=webp"
  },
  {
    "title": "AI Systems Performance Engineering",
    "description": "Elevate your AI system performance capabilities with this definitive guide to unlocking peak efficiency across every layer of your AI infrastructure. In today's era of ever-growing generative models, AI Systems Performance Engineering equips professionals with actionable strategies to co-optimize hardware, software, and algorithms for high-performance and cost-effective AI systems. Authored by Chris Fregly, a performance-focused engineering and product leader, this comprehensive resource transforms complex systems into streamlined, high-impact AI solutions.Inside, you'll discover step-by-step methodologies for fine-tuning GPU CUDA kernels, PyTorch-based algorithms, and multinode training and inference systems. You'll also master the art of scaling GPU clusters for high performance, distributed model training jobs, and inference servers.Codesign and optimize hardware, software, and algorithms to achieve maximum throughput and cost savingsImplement cutting-edge inference strategies that reduce latency and boost throughput in real-world settingsUtilize industry-leading scalability tools and frameworksProfile, diagnose, and eliminate performance bottlenecks across complex AI pipelinesIntegrate full stack optimization techniques for robust, reliable AI system performanceWhether you're an engineer, researcher, or developer, AI Systems Performance Engineering offers a holistic roadmap for building resilient, scalable, and cost-effective AI systems that excel in both training and inference.",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341627772/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341627772/160h/?format=webp"
  },
  {
    "title": "Applied AI for Enterprise Java Development",
    "description": "As a Java enterprise developer or architect, you know that embracing AI isn't just optional—it's critical to keeping your competitive edge. The question is, how can you skillfully incorporate these groundbreaking AI technologies into your applications without getting mired in complexity? Enter this clear-cut, no-nonsense guide to integrating generative AI into your Java enterprise ecosystem. With insights from authors Alex Soto Bueno, Markus Eisele, and Natale Vinto, you'll learn to marry the robustness of Java's enterprise world with the dynamism of AI. It's more than just a how-to—it's a way to elevate enterprise software with savvy AI integrations, ensuring your skills and your applications remain on the cutting edge. Inside, you'll unlock the power to: Demystify GenAI's role and impact on contemporary software development Craft actionable, AI-driven applications using Java's rich ecosystem of open source frameworks Implement field-tested AI patterns tailored for prod-ready, enterprise-strength applications Access and integrate top-tier open source AI models with Java's Inference APIs Navigate the Java framework landscape with AI-centric agility and confidence",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098174491/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098174491/160h/?format=webp"
  },
  {
    "title": "The LLM Mesh",
    "description": "In the rapidly evolving landscape of generative AI and particularly large language models (LLMs), organizations are poised to create groundbreaking applications. However, the lack of oversight, governance, and centralization often stymies the deployment of LLM-based applications. For organizations eager to harness the full potential of LLMs, overcoming these hurdles is essential—not only for operational success but also to stay ahead in a competitive market. This tech guide introduces the LLM Mesh, an architecture paradigm that ensures modular development, centralized administration, and auditing of LLM applications. It allows companies not only to keep pace with rapid changes and new market entrants but also to maintain independence from any single provider. Through detailed instructions and expert advice, learn how to abstract applications from LLM services, integrate robust security measures, manage compliance, and optimize costs and performance across various platforms. By the end of this guide, you will: Understand the enterprise challenges associated with building LLM-powered applications Recognize the benefits of implementing an LLM Mesh within large organizations Learn comprehensive strategies for the safe, secure, and scalable utilization of LLMs Select appropriate LLMs and hosting methods tailored to specific applications",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098176631/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098176631/160h/?format=webp"
  },
  {
    "title": "Building Data Integration Solutions",
    "description": "Are you struggling to manage and make sense of the vast streams of data flowing into your organization? In today's data-driven world, the ability to effectively unify and organize disparate data sources is not just an advantage—it's a necessity. The challenge lies in navigating the complexities of data diversity, volume, and regulatory demands, which can overwhelm even the most seasoned data professionals. In this essential book, Jay Borthen offers a comprehensive guide to understanding the art of data integration. This book dives deep into the processes and strategies necessary for creating effective data pipelines that ensure consistency, accuracy, and accessibility of your data. Whether you're a novice looking to understand the basics or an experienced professional aiming to refine your skills, Borthen's insights and practical advice, grounded in real-world case studies, will empower you to transform your organization's data handling capabilities. You will: Understand various data integration solutions and how different technologies can be employed Gain insights into the relationship between data integration and the overall data lifecycle Learn to effectively design, set up, and manage data integration components within pipelines Acquire the knowledge to configure pipelines, perform data migrations, transformations, and more",
    "published_at": "November 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098173050/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098173050/160h/?format=webp"
  },
  {
    "title": "Building Micro-Frontends, 2nd Edition",
    "description": "What's the answer to today's increasingly complex applications? Micro-frontends. Inspired by the microservices model, this approach lets you break interfaces into separate features managed by different teams of developers. In this updated second edition, software architects, tech leads, and software developers will learn how to design, build, and deploy independent micro-frontends that compose unique frontend systems. Author Luca Mezzalira, principal serverless specialist solutions architect at AWS, shows you how micro-frontends enable agility within an organization, decentralize decision-making, and optimize for fast flow. This gives your organization technical flexibility and allows you to hire and retain a broad spectrum of talent. Micro-frontends also support distributed or colocated teams more efficiently. Pick up this book and learn how to get started with this technological breakthrough right away. You will: Understand the four pillars for creating a successful micro-frontend architecture Learn principles and best practices that will enable your teams to succeed with this architecture Examine the benefits and pitfalls of existing micro-frontend architectures Learn how micro-frontends work in conjunction with other distributed systems like microservices Discover different architectures for creating client-side and server-side micro-frontend architectures Learn automation best practices that will empower your organization to optimize for fast flow",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098170776/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098170776/160h/?format=webp"
  },
  {
    "title": "Hands-On Machine Learning with Scikit-Learn and PyTorch",
    "description": "The potential of machine learning today is extraordinary, yet many aspiring developers and tech professionals find themselves daunted by its complexity. Perhaps you're ready to jump in, but you're unsure where or how to begin. Whether you're looking to enhance your skill set and apply machine learning to real-world projects or are simply curious about how AI systems function, this book is your jumping-off place.In a way that's approachable yet deeply informative, author Aurélien Géron delivers the ultimate introductory guide to machine learning and deep learning. With a focus on clear explanations and real-world Python examples, the book takes you through cutting-edge tools like scikit-learn and PyTorch—from basic regression techniques to advanced neural networks like transformers and generative adversarial networks. Whether you're a student, professional, or hobbyist, you'll gain the skills to begin building intelligent systems.Understand ML basics, including concepts like overfitting and hyperparameter tuning Learn to build end-to-end ML projects using scikit-learn, from data exploration to model evaluation Explore advanced architectures like convolutional and recurrent neural networks with PyTorch Discover techniques for unsupervised learning, such as clustering and anomaly detection Increase your expertise in state-of-the-art AI systems by fine-tuning pretrained models Build tangible skills with complete hands-on coding exercises and real-world applications",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341607972/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341607972/160h/?format=webp"
  },
  {
    "title": "Linux on Azure",
    "description": "With multiple distributions, evolving cloud services, and complex deployment considerations, navigating Linux in Azure can be overwhelming. Linux on Azure: A Practical Guide equips IT professionals, cloud architects, and DevOps engineers with the knowledge and strategies they need to deploy, manage, and optimize Linux-based workloads with confidence. This guide explores key Azure services and how they integrate with Linux to provide enhanced performance, security, and scalability. Covering Red Hat Enterprise Linux (RHEL), Ubuntu, SUSE, and Azure Linux, it provides a clear road map for running everything from cloud native and AI-driven applications to mission-critical enterprise workloads. Whether you're migrating existing systems or building new solutions, this book delivers the practical insights and hands-on strategies needed to streamline operations, reduce costs, and unlock the full power of Linux on Azure. Understand IaaS, PaaS, and cloud native deployment options Deploy Linux workloads efficiently using Azure tools Optimize security, performance, and cost-efficiency Automate infrastructure with CI/CD pipelines and Azure Compute Gallery",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341621435/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341621435/160h/?format=webp"
  },
  {
    "title": "Mastering Ethereum, 2nd Edition",
    "description": "As the first blockchain platform to introduce the concept of smart contracts, Ethereum serves as the gateway to a worldwide, decentralized computing paradigm. With this practical guide, Carlo Parisi, Alessandro Mazza, and Niccolo Pozzolini provide everything you need to know about building smart contracts and DApps on Ethereum and other virtual-machine blockchains. You'll find comprehensive coverage of Ethereum's internal workings to help you understand not just the how but also the why of Ethereum's innovative technology. You'll dive deep into the architecture and operational mechanics of Ethereum by learning essential knowledge for building and interacting effectively with DApps and smart contracts on Ethereum and similar virtual-machine blockchains. Run an Ethereum client, create and transmit basic transactions, and program smart contracts Learn the essentials of public key cryptography, hashes, and digital signatures Understand how \"wallets\" hold digital keys that control funds and smart contracts Interact with Ethereum clients programmatically using JavaScript libraries and remote procedure call interfaces Learn security best practices, design patterns, and antipatterns with real-world examples Build simple decentralized applications using multiple peer-to-peer components Learn the essentials about DeFi and zero knowledge proofs Understand how the Consensus of Ethereum works and the challenges it presents Read and write basic Solidity and Vyper code",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098168414/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098168414/160h/?format=webp"
  },
  {
    "title": "Visualizing Generative AI",
    "description": "Generative AI has the potential to innovate and evolve business processes, but workers are still figuring out how to build with, optimize, and prompt GenAI tools to fit their needs. And of course, there are pitfalls to avoid, like security risks and hallucinations. Getting it right requires an intuitive understanding of the technology's capabilities and limitations. This approachable guidebook helps learners of all levels navigate GenAI—and have fun while doing it.Loaded with insightful diagrams and illustrations, Visualizing Generative AI is the perfect entry point for curious IT professionals, business leaders who want to stay on top of the latest technologies, students exploring careers in cloud computing and AI, and anyone else interested in getting started with GenAI. You'll traverse the generative AI landscape, exploring everything from how this technology works to the ways organizations are already putting it to work to great success.Understand how generative AI has evolved, with a focus on major breakthroughsGet acquainted with the available tools and platforms for GenAI workloadsExamine real-world applications, such as chatbots and workflow automationLearn fundamentals that you can build upon as you continue your GenAI journey",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098172299/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098172299/160h/?format=webp"
  },
  {
    "title": "Crafting Engineering Strategy",
    "description": "Many engineers assume their organization doesn't have an engineering strategy—when in fact, they often do. It just may not be working. In Crafting Engineering Strategy, Will Larson (author of An Elegant Puzzle, Staff Engineer, and The Engineering Executive's Primer) offers a practical, example-rich guide to navigating technical and organizational complexity through structured, intentional strategy.Written for senior engineers, engineering leaders, architects, and curious collaborators, this book lays out a repeatable process for building effective, actionable strategies—from early diagnosis to rollout. With lessons drawn from real-world case studies at companies like Stripe, Uber, and Calm, Larson provides a framework for shaping critical decisions around system migrations, API deprecations, platform investments, and more. Along the way, you'll learn to augment technical planning with communication, governance, and systems thinking. Whether you're shaping your team's direction or leading a company-wide initiative, Crafting Engineering Strategy will help you make thoughtful decisions that stick.Build durable engineering strategies from first principlesApply methods like Wardley mapping and systems modelingLead strategy as a staff+ engineer or executiveLearn from detailed case studies across industriesImprove your strategic fluency and influence over time",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341645516/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341645516/160h/?format=webp"
  },
  {
    "title": "Sustainable AI",
    "description": "In the era of big data and even bigger machine learning models, the environmental footprint of these technologies can no longer be ignored. This much-needed guide confronts the challenge head-on, offering a groundbreaking exploration into making deep learning (DL) both efficient and accessible. Author Raghavendra Selvan exposes the high costs—both environmental and economic—of traditional DL methods and presents practical solutions that pave the way for a more sustainable AI. This essential read is for anyone in the machine learning field, from the academic researcher to the industry practitioner, who wants to make a meaningful impact on both their work and the world. This book enables readers to be agents of change toward a more sustainable and inclusive technological future. In this book, you will: Learn strategies to significantly reduce the energy consumption, carbon footprint, and hardware demands of DL models Examine ways to break down barriers and foster a more inclusive future in AI development Explore strategies for cutting costs and minimizing ecological impact Learn how to balance performance with efficiency in model development Gain proficiency in cutting-edge tools that enhance the sustainability of your AI projects",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098155506/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098155506/160h/?format=webp"
  },
  {
    "title": "Container Security, 2nd Edition",
    "description": "As containerized and cloud native applications become foundational to modern software infrastructure, the need for a deep, conceptual understanding of their security implications has never been more urgent. Container Security offers a rigorous yet practical examination of the technologies that underpin container platforms—equipping developers, operations professionals, and security practitioners with the mental models needed to evaluate risk and enhance resilience.Written by Liz Rice, a recognized authority in cloud native security, this updated edition builds on the foundational principles from the first edition while incorporating today's evolving threat landscape, modern tooling, and advancements in platforms like Kubernetes and Linux. Readers will gain a firm grasp of the architectural components behind containers and the Linux primitives that support them, fostering a systems-level understanding of both vulnerabilities and mitigation strategies.Examine the technical underpinnings of containers through a security-focused lens Evaluate evolving risks and defenses across container runtimes and orchestration platforms Analyze the implications of modern tooling including eBPF and AI-driven approaches Apply core principles to assess and secure real-world deployments in dynamic environments",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341627697/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341627697/160h/?format=webp"
  },
  {
    "title": "Generative AI Design Patterns",
    "description": "Generative AI enables powerful new capabilities, but they come with some serious limitations that you'll have to tackle to ship a reliable application or agent. Luckily, experts in the field are already hard at work compiling a library of tried-and-true design patterns to address the challenges you're likely to encounter when building applications using LLMs and other GenAI models—hallucinations, nondeterministic answers, and knowledge cutoffs among them. You'll find 31 of the most essential here.Authors Valliappa Lakshmanan and Hannes Hapke codify advances in research and real-world experience into advice that you can readily incorporate into your projects. Each detailed explanation includes a description of the problem, a proven pattern to solve it, an example, and a discussion of potential trade-offs. Whether you read it cover to cover for inspiration or use it as a daily reference, this practical guide will help you troubleshoot whatever problems may arise.Design around the limitations of LLMs, such as hallucination and nondeterminismForce LLMs to generate text that follows a specific style or grammarMaximize creativity while balancing different types of riskExtend the capability of an LLM beyond just content creationUse patterns together to solve a variety of different use cases",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341622654/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341622654/160h/?format=webp"
  },
  {
    "title": "Salesforce Certified Platform Administrator Study Guide",
    "description": "Whether you're just starting your Salesforce journey, planning a career shift, or simply curious about the world of cloud computing and customer relationship management (CRM), this practical book is the source you need. Packed with foundational knowledge and practical insights, the Salesforce Certified Administrator Study Guide helps you understand the cloud, CRM, and the entire Salesforce ecosystem. Author Mike Wheeler, who's worked on the Salesforce platform as an administrator, developer, and consultant, takes you through the certification process and Salesforce's vast and dynamic realm. This book serves as a vital pathway to proficiency, ensuring that professionals are equipped to harness Salesforce's capabilities and stand out in the competitive landscape of digital transformation. With this guide you will: Explore the foundational concepts and architecture of Salesforce and its role as the leading CRM platform Learn the intricacies of Salesforce administration from data management to customization and security Understand the significance and structure of the Salesforce Administrator Certification, including the knowledge areas it encompasses Navigate and configure the Salesforce platform with confidence, optimizing it for your organization's specific needs Implement best practices in Salesforce administration, ensuring efficient and secure operations Mike Wheeler holds eight Salesforce certifications and has worked professionally on the Salesforce platform as an administrator, developer, and consultant.",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098165734/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098165734/160h/?format=webp"
  },
  {
    "title": "Advanced Snowflake",
    "description": "As Snowflake's capabilities expand, staying updated with its latest features and functionalities can be overwhelming. The platform's rapid development gave rise to advanced tools like Snowpark and the Native App Framework, which are crucial for optimizing data operations but may seem complex to navigate.In this essential book, author Muhammad Fasih Ullah offers a detailed guide to understanding these sophisticated tools, ensuring you can leverage the full potential of Snowflake for data processing, application development, and deploying machine learning models at scale. You'll gain actionable insights and structured examples to transform your understanding and skills in handling advanced data scenarios within Snowflake. By the end of this book, you will:Grasp advanced features such as Snowpark, Snowflake Native App Framework, and Iceberg tablesEnhance your projects with geospatial functions for comprehensive geospatial analyticsInteract with Snowflake using a variety of programming languages through SnowparkImplement and manage machine learning models effectively using Snowpark MLDevelop and deploy applications within the Snowflake environment",
    "published_at": "October 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9781098170202/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9781098170202/160h/?format=webp"
  },
  {
    "title": "Comprendre l'ETL (édition mise à jour)",
    "description": "Cet ouvrage a été traduit à l'aide de l'IA. Tes réactions et tes commentaires sont les bienvenus : translation-feedback@oreilly.comL'« extraction, transformation, chargement » (ETL) est au cœur de toutes les applications de données, de la veille économique à l'IA. Les changements constants dans le paysage des données, comme la mise en place d'architectures lakehouse et l'importance des données en temps réel à grande échelle, font que les pros des données d'aujourd'hui doivent aborder l'ETL un peu différemment. Ce guide technique mis à jour offre aux ingénieurs de données, aux responsables techniques et aux architectes une vue d'ensemble du processus ETL moderne, ainsi que les défis auxquels vous êtes susceptible d'être confronté et les modèles stratégiques qui vous aideront à les surmonter. Vous serez ainsi en mesure de prendre des décisions éclairées lors de la mise en œuvre de l'ETL et de choisir en toute confiance la pile technologique qui vous aidera à réussir.Découvrez à quoi ressemble l'ETL dans le nouveau monde des data lakehousesApprenez à gérer les données en temps réelExplorez les outils ETL low-codeComprenez comment atteindre au mieux l'évolutivité, les performances et l'observabilité",
    "published_at": "September 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341671140/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341671140/160h/?format=webp"
  },
  {
    "title": "ETLを理解する（改訂版）",
    "description": "この作品はAIを使って翻訳されている。ご意見、ご感想をお待ちしている：translation-feedback@oreilly.com「抽出、変換、ロード」（ETL）は、ビジネス知能からAIに至るまで、あらゆるデータアプリケーションの中核をなす。データ環境の絶え間ない変化——レイクハウスアーキテクチャの実装や大規模リアルタイムデータの重要性など——は、現代のデータ実務者がETLに従来とは異なるアプローチを必要としていることを意味する。 この更新版技術ガイドは、データエンジニア、エンジニアリングマネージャー、アーキテクト向けに、現代的なETLプロセスの概要、直面する可能性のある課題、そしてそれらを克服するための戦略的パターンを提供する。読了後には、ETL実装時に情報に基づいた意思決定を行い、成功に導く技術スタックを選択する信頼性が得られるだろう。データレイクハウスという新たな世界におけるETLの実態を探るリアルタイムデータの扱い方を学ぶローコードETLツールを探求するスケーラビリティ、パフォーマンス、可観測性を最適に実現する方法を理解する",
    "published_at": "September 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341671188/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341671188/160h/?format=webp"
  },
  {
    "title": "ETL 이해하기 (개정판)",
    "description": "이 작품은 AI를 사용하여 번역되었습니다. 여러분의 피드백과 의견을 환영합니다: translation-feedback@oreilly.com\"추출, 변환, 로드\"(ETL)는 비즈니스 인텔리전스부터 인공지능에 이르기까지 모든 데이터 활용의 핵심입니다. 레이크하우스 아키텍처 구현과 대규모 실시간 데이터의 중요성 증가 등 데이터 환경의 지속적인 변화로 인해 오늘날 데이터 실무자들은 ETL에 조금 다른 접근 방식을 취해야 합니다. 이 업데이트된 기술 가이드는 데이터 엔지니어, 엔지니어링 관리자, 아키텍트를 대상으로 현대적 ETL 프로세스의 개요와 함께 직면할 가능성이 높은 과제들, 그리고 이를 극복하는 데 도움이 될 전략적 패턴을 제공합니다. 이를 통해 ETL 구현 시 정보에 기반한 결정을 내릴 수 있는 역량을 갖추게 되며, 성공을 이끄는 기술 스택 선택에 대한 확신을 얻을 수 있습니다.데이터 레이크하우스라는 새로운 환경에서 ETL의 진화한 모습을 확인하세요실시간 데이터 처리 방법 학습로우코드 ETL 도구 탐색확장성, 성능, 가시성을 최적으로 달성하는 방법 이해하기",
    "published_at": "September 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341671195/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341671195/160h/?format=webp"
  },
  {
    "title": "ETL verstehen (aktualisierte Ausgabe)",
    "description": "Diese Arbeit wurde mithilfe von KI übersetzt. Wir freuen uns über dein Feedback und deine Kommentare: translation-feedback@oreilly.com„Extrahieren, transformieren, laden“ (ETL) ist das Herzstück jeder Datenanwendung, von Business Intelligence bis hin zu KI. Ständige Veränderungen in der Datenlandschaft – wie die Einführung von Lakehouse-Architekturen und die Bedeutung von Echtzeitdaten in großem Maßstab – bedeuten, dass Datenfachleute heute ETL etwas anders angehen müssen. Dieser aktualisierte technische Leitfaden bietet Dateningenieuren, Engineering-Managern und Architekten einen Überblick über den modernen ETL-Prozess sowie über die Herausforderungen, denen Sie wahrscheinlich begegnen werden, und die strategischen Muster, die Ihnen helfen, diese zu meistern. Sie werden in die Lage versetzt, fundierte Entscheidungen bei der Implementierung von ETL zu treffen und sich sicher für den Technologie-Stack zu entscheiden, der Ihnen zum Erfolg verhilft.Entdecke, wie ETL in der neuen Welt der Data Lakehouses aussiehtLerne, wie du mit Echtzeitdaten umgehstEntdecke Low-Code-ETL-ToolsVerstehe, wie du Skalierbarkeit, Leistung und Beobachtbarkeit am besten erreichen kannst",
    "published_at": "September 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341671089/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341671089/160h/?format=webp"
  },
  {
    "title": "Comprender el ETL (edición actualizada)",
    "description": "Este trabajo se ha traducido utilizando IA. Agradecemos tus opiniones y comentarios: translation-feedback@oreilly.com«Extraer, transformar y cargar» (ETL) es el núcleo de todas las aplicaciones de datos, desde la inteligencia empresarial hasta la inteligencia artificial. Los constantes cambios en el panorama de los datos, incluida la implementación de arquitecturas lakehouse y la importancia de los datos en tiempo real a gran escala, hacen que los profesionales de los datos de hoy en día deban abordar el ETL de una forma ligeramente diferente. Esta guía técnica actualizada ofrece a los ingenieros de datos, directores de ingeniería y arquitectos una visión general del proceso ETL moderno, junto con los retos a los que es probable que te enfrentes y los patrones estratégicos que te ayudarán a superarlos. Al finalizar, estarás preparado para tomar decisiones informadas a la hora de implementar ETL y te sentirás seguro a la hora de elegir la pila tecnológica que te ayudará a alcanzar el éxito.Descubre cómo es el ETL en el nuevo mundo de los data lakehousesAprende a manejar datos en tiempo realExplora las herramientas ETL de bajo códigoComprende cómo lograr de la mejor manera la escala, el rendimiento y la observabilidad",
    "published_at": "September 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341671119/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341671119/160h/?format=webp"
  },
  {
    "title": "Entendendo o ETL (Edição atualizada)",
    "description": "Este trabalho foi traduzido com recurso a IA. Agradecemos o teu feedback e comentários: translation-feedback@oreilly.com“Extrair, transformar, carregar” (ETL) é o centro de todas as aplicações de dados, desde inteligência de negócios até IA. Mudanças constantes no cenário de dados — incluindo as implementações de arquiteturas lakehouse e a importância dos dados em tempo real em alta escala — significam que os profissionais de dados de hoje precisam abordar o ETL de uma maneira um pouco diferente. Este guia técnico atualizado oferece aos engenheiros de dados, gerentes de engenharia e arquitetos uma visão geral do processo ETL moderno, juntamente com os desafios que você provavelmente enfrentará e os padrões estratégicos que o ajudarão a superá-los. Você sairá preparado para tomar decisões informadas ao implementar o ETL e confiante na escolha da pilha de tecnologia que o ajudará a ter sucesso.Descubra como é o ETL no novo mundo dos data lakehousesAprenda a lidar com dados em tempo realExplore ferramentas ETL de baixo códigoEntenda como alcançar melhor escala, desempenho e observabilidade",
    "published_at": "September 2025",
    "detail_link": "https://learning.oreilly.com/library/view/-/9798341671201/",
    "cover_image": "https://www.oreilly.com/covers/urn:orm:book:9798341671201/160h/?format=webp"
  }
]